In [1]:
import pandas as pd
import tensorflow_hub as hub
import openai 
import numpy as np
import altair as alt
from openai import OpenAI
from sql_metadata import Parser
import os
from IPython.display import display, Markdown
import ast
import cx_Oracle
import re

from pathlib import Path
import sys
sys.path.append('../')
import scripts.eval
from scripts.eval import execute_query 
from scripts.eval import metric 
import json
import requests
import datetime

2024-04-26 17:03:54.285852: E external/local_xla/xla/stream_executor/cuda/cuda_dnn.cc:9261] Unable to register cuDNN factory: Attempting to register factory for plugin cuDNN when one has already been registered
2024-04-26 17:03:54.286028: E external/local_xla/xla/stream_executor/cuda/cuda_fft.cc:607] Unable to register cuFFT factory: Attempting to register factory for plugin cuFFT when one has already been registered
2024-04-26 17:03:54.342839: E external/local_xla/xla/stream_executor/cuda/cuda_blas.cc:1515] Unable to register cuBLAS factory: Attempting to register factory for plugin cuBLAS when one has already been registered
2024-04-26 17:03:54.467919: I tensorflow/core/platform/cpu_feature_guard.cc:182] This TensorFlow binary is optimized to use available CPU instructions in performance-critical operations.
To enable the following instructions: AVX2 FMA, in other operations, rebuild TensorFlow with the appropriate compiler flags.
2024-04-26 17:03:55.266027: W tensorflow/compiler/tf2tensorrt/utils/py_utils.cc:38] TF-TRT Warning: Could not find TensorRT

# Read csv-files

In [3]:
prefix = Path.cwd().parent.parent
pd.set_option('display.max_columns', None)
pd.set_option('display.max_colwidth', None)
prefix

PosixPath('/home/skikk/Dokumente/uni/WS2324/MIT/llm-enterprise')

In [4]:
with open('../../config.json') as f:
  config = json.load(f)

In [22]:
df_q = pd.read_json((str(prefix) + '/data/50_queries.json'))

In [23]:
df_q

,question,sql
0,How many organisation units in human resources are relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new INTERSECT SELECT hr_org_unit_key FROM hr_org_unit);
1,How many organisation units in human resources are new and not relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new MINUS SELECT hr_org_unit_key FROM hr_org_unit);
2,COUNT the number of courses offered by each department.,"SELECT OFFER_DEPT_CODE, COUNT(*) AS course_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE;"
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, academic_terms.term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM SUBJECT_SUMMARY, academic_terms WHERE SUBJECT_SUMMARY.term_code = academic_terms.term_code;"
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt FROM WAREUSER.FCLT_BUILDING_ADDRESS_HIST GROUP BY fclt_building_key);
5,What is the average number of courses a student can enroll in?,"SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt FROM mit_student_directory, SUBJECT_SUMMARY WHERE DEPARTMENT_CODE = department GROUP BY full_name);"
6,Which students are employed by mit?,"SELECT DISTINCT empl.full_name FROM mit_student_directory mit, employee_directory empl WHERE empl.full_name = mit.full_name;"
7,What is the shortest course available this semester?,"SELECT DISTINCT subject_title, term_end_date - term_start_date FROM (SELECT MIN(term_end_date - term_start_date) AS min_duration FROM academic_terms), academic_terms, SUBJECT_SUMMARY WHERE SUBJECT_SUMMARY.term_code = ACADEMIC_TERMS.TERM_CODE AND term_end_date - term_start_date = min_duration;"
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM wareuser.fac_building fb INNER JOIN wareuser.fac_building_address fba ON fb.FAC_BUILDING_KEY = fba.building_key;"
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM library_material_status UNION SELECT DISTINCT tip_material_status FROM tip_material_status;
11,What are the different cities WHERE people live?,SELECT DISTINCT city_name FROM zip_usa UNION SELECT DISTINCT city_name FROM zip_canada;
12,Give the average number of courses in one department with more than 100 courses.,"SELECT AVG(offered_subject_nr) FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS offered_subject_nr FROM SUBJECT_SUMMARY) WHERE offered_subject_nr >= 100;"
13,Count the number of rooms in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;"
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, num_spaces FROM (SELECT BUILDING_KEY, COUNT(*) OVER (PARTITION BY BUILDING_KEY) as num_spaces FROM SPACE_DETAIL) sd, FAC_BUILDING WHERE FAC_BUILDING.FAC_BUILDING_KEY = sd.BUILDING_KEY;"
15,"For courses that have descriptions of Regular and Initial, what are their start dates?","SELECT SUBJECT_TITLE, TERM_START_DATE FROM (SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE SUBJECT_DESCRIPTION LIKE '%regular%' OR SUBJECT_DESCRIPTION LIKE '%initial%') COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL WHERE COURSE_CATALOG_SUBJECT_OFFERED.EFFECTIVE_TERM_CODE = ACADEMIC_TERMS_ALL.TERM_CODE;"
16,What are the names of the 3 departments which offer the most courses per semester?,"SELECT * FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS numcourses FROM SUBJECT_SUMMARY ORDER BY numcourses DESC) WHERE rownum <= 3;"
17,WHERE is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FROM (SELECT office_location FROM employee_directory WHERE full_name = 'Stonebraker, Michael'), fac_rooms, fac_building_address WHERE office_location = fac_room_key AND fac_rooms.building_key = fac_building_address.BUILDING_KEY;"
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELECT full_name, COUNT(*) OVER (PARTITION BY full_name) AS cnt FROM employee_directory) employee, employee_directory WHERE employee.full_name = employee_directory.full_name AND cnt >= 2 ORDER BY employee.full_name;"
19,Show the name for subjects which are enrollable for Computer Science Students.,SELECT DISTINCT subject_title FROM SUBJECT_SUMMARY WHERE department_name = 'Electrical Eng & Computer Sci';
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITION BY department_name) FROM mit_student_directory;"
21,What categories are there for independent activities periods?,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_name FROM zip_usa) UNION (SELECT postal_code, city_name FROM zip_canada)) WHERE zip_code = '00501';"
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_directory;
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) FROM student_department;"
25,"Show the name, kerberos credentials, and email for the employee with the name 'Michael'.","SELECT full_name, krb_name, email_address FROM employee_directory WHERE first_name = 'Michael';"
26,Show the school with the largest number of departments.,"SELECT * FROM (SELECT * FROM (SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) AS cnt FROM student_department) ORDER BY cnt DESC) WHERE rownum <= 1;"
27,What are the courses with the maximum number of units?,"SELECT * FROM SUBJECT_SUMMARY, (SELECT MAX(total_units) AS maxi FROM SUBJECT_SUMMARY) WHERE total_units = maxi;"
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level_domain_description = 'Brazil';
29,What are all the different start dates of courses of computer science that lasted less than 100 days?,"SELECT DISTINCT * FROM (SELECT subject_title, department_name, term_start_date, term_end_date - term_start_date AS duration FROM SUBJECT_SUMMARY a, ACADEMIC_TERMS b WHERE a.term_code = b.term_code AND department_name = 'Electrical Eng & Computer Sci') WHERE duration <= 100;"
30,List the courses and format for all courses that have a number of attendees greater than 800.,"SELECT DISTINCT subject_title, form_type, num_enrolled_students FROM subject_offered WHERE num_enrolled_students > 800;"
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT * FROM (SELECT c.title, c.isbn, COUNT(*) OVER (PARTITION BY c.title, c.isbn) AS cnt FROM tip_detail a, tip_subject_offered b, tip_material c WHERE is_no_course_material LIKE 'N' AND a.tip_subject_offered_key = b.tip_subject_offered_key AND a.tip_material_key = c.tip_material_key) ORDER BY cnt DESC) WHERE ROWNUM <= 1;"
32,"Show activity title, location, and supervisor for all independent activities ordered by start-date.","SELECT DISTINCT activity_title, session_location, term_start_date, person_name AS Leader FROM iap_subject_detail a, iap_subject_person b, academic_terms_all c, iap_subject_session d WHERE a.iap_subject_person_key = b.iap_subject_person_key AND a.iap_subject_session_key = d.iap_subject_session_key AND c.term_code = a.term_code AND b.person_role = 'Activity leader';"
33,"What are the titles and isbn numbers for all materials, sorted in ascending order of their price?","SELECT DISTINCT title, isbn, new_shelf_price FROM tip_material ORDER BY new_shelf_price ASC;"
34,Which were the first registered subjects?,"SELECT subject_title FROM COURSE_CATALOG_SUBJECT_OFFERED c, ACADEMIC_TERMS d, (SELECT MIN(academic_year) AS mini FROM COURSE_CATALOG_SUBJECT_OFFERED) WHERE c.effective_term_code = d.term_code AND d.academic_year = mini;"
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT DISTINCT department_name, COUNT(*) OVER (PARTITION BY department_name) AS cnt FROM mit_student_directory) WHERE cnt <= 300;"
36,Which department has the most kinds of payroll ranks?,"SELECT * FROM (SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id) a, (SELECT MAX(cnt) AS m FROM ((SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id)) ) b WHERE a.cnt = b.m;"
37,List email adress and names of student and employee whose first name is Carole.,"SELECT DISTINCT full_name, email_address FROM (SELECT DISTINCT first_name, full_name, email_address FROM mit_student_directory union SELECT DISTINCT first_name, full_name, email_address FROM employee_directory) WHERE first_name = 'Carole';"
38,what are the different payment roll ranks?,SELECT DISTINCT payroll_rank FROM wareuser.se_person;
39,List buildings which were build before 1950 and have more than 100 employees.,"SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, year_built, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG, year_built) as num_employees FROM ( SELECT * FROM (SELECT DISTINCT FCLT_BUILDING_KEY, BUILDING_NAME_LONG, extract(year FROM TO_DATE(date_built, 'MM/DD/YYYY')) as year_built FROM wareuser.fclt_building_hist) WHERE year_built <= 1950) a, fclt_rooms, employee_directory WHERE OFFICE_LOCATION = BUILDING_ROOM and fclt_rooms.FCLT_BUILDING_KEY = a.FCLT_BUILDING_KEY) WHERE num_employees >100;"
40,How many courses are there in the centre for international studies?,SELECT COUNT(DISTINCT subject_id) FROM cis_course_catalog;
41,What is the number of offered courses WHERE more than 100 students are enrolled?,SELECT COUNT(DISTINCT subject_id) FROM subject_offered WHERE num_enrolled_students > 100;
42,Who is sharing his office with at least one other person?,"SELECT DISTINCT mit_id, full_name, a.office_location, num_employees FROM DRUPAL_EMPLOYEE_DIRECTORY a, (SELECT office_location, COUNT(mit_id) OVER(PARTITION BY office_location) as num_employees FROM (SELECT mit_id, office_location FROM DRUPAL_EMPLOYEE_DIRECTORY union SELECT full_name, office_location FROM mit_student_directory)) b WHERE b.num_employees>= 2 and b.office_location = a.office_location;"
43,List the subject-groups and their number of courses which start in March?,"SELECT DISTINCT CLUSTER_LIST, COUNT(subject_id) OVER (PARTITION BY CLUSTER_LIST) FROM SUBJECT_SUMMARY, academic_terms_all WHERE extract(month FROM term_start_date) = 3;"
44,"List course instructors, their courses and the amount of material for them.","SELECT DISTINCT instructor_name, subject_title, COUNT(catalog_isbn) OVER (PARTITION BY instructor_name, subject_title) FROM LIBRARY_COURSE_INSTRUCTOR, LIBRARY_RESERVE_MATRL_DETAIL, LIBRARY_SUBJECT_OFFERED, LIBRARY_RESERVE_CATALOG WHERE LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_COURSE_INSTRUCTOR_KEY and LIBRARY_RESERVE_CATALOG.LIBRARY_RESERVE_CATALOG_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_RESERVE_CATALOG_KEY and LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY;"
45,Which building accomodates the most students?,"SELECT * FROM( SELECT * FROM( SELECT DISTINCT building_name, num_students FROM (SELECT fclt_building_key, COUNT(full_name) OVER (PARTITION BY fclt_building_key) as num_students FROM fclt_rooms, mit_student_directory WHERE office_location=BUILDING_ROOM) a, fclt_building WHERE a.fclt_building_key = fclt_building.fclt_building_key) ORDER BY num_students DESC)WHERE ROWNUM <= 1;"
46,Which building has on average the most rooms per floor?,"SELECT * FROM(SELECT DISTINCT building_name, num_rooms/num_floors FROM( SELECT fclt_building_key, COUNT(DISTINCT fclt_floor_key) OVER (PARTITION BY fclt_building_key) as num_floors, COUNT(DISTINCT fclt_room_key) OVER (PARTITION BY fclt_building_key) as num_rooms FROM fclt_rooms) a, fclt_building WHERE a.fclt_building_key = fclt_building.fclt_building_key ORDER BY num_rooms/num_floors DESC) WHERE ROWNUM <= 1;"
47,What is the most common usage for all rooms.,"SELECT * FROM(SELECT DISTINCT major_use, num_rooms FROM (SELECT fclt_major_use_key, COUNT(fclt_room_key) OVER (PARTITION BY fclt_major_use_key) as num_rooms FROM fclt_rooms) a, fclt_major_use WHERE a.fclt_major_use_key = fclt_major_use.fclt_major_use_key ORDER BY num_rooms DESC) WHERE rownum <= 1;"
48,Which IAP instructor has held the most sessions of the same course?,"SELECT * FROM (SELECT DISTINCT person_name, activity_title, COUNT(IAP_subject_session_key) OVER (PARTITION BY person_name,activity_title) as num_session FROM iap_subject_detail, iap_subject_person WHERE IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY) ORDER BY num_session DESC;"
49,What is the largest building?,"SELECT * FROM(SELECT DISTINCT building_key, sum(room_square_footage) OVER (PARTITION BY building_key) as total_square_footage FROM space_detail) ORDER BY total_square_footage DESC;"

In [7]:
sqls = []
for q in df_q['sql']:
    sqls.append([q])
df_q['sql'] = sqls

In [8]:
questions = []
tables = []
sqls=[]
for i in range(len(df_q)):
    sql = []
    table = []
    for q in df_q['sql'][i]:
        q = q.upper().replace('WAREUSER.', '')
        t = Parser(q).tables
        table.append(t)
        sql.append(q.upper())
    questions.append(df_q['question'][i])
    sqls.append(sql)
    tables.append(table)
df_q = pd.DataFrame(data={"question":questions, "sql":sqls, "tables":tables})

In [9]:
df_q['tables'] = tables

## Identify the unique tables referred by the corpus

In [10]:
unique_tables = set()
for  l in tables: 
    for t in l:
        for t_ in t:
            unique_tables.add(t_.upper())

In [11]:
unique_tables

{'ACADEMIC_TERMS',
 'ACADEMIC_TERMS_ALL',
 'CIS_COURSE_CATALOG',
 'COURSE_CATALOG_SUBJECT_OFFERED',
 'DRUPAL_EMPLOYEE_DIRECTORY',
 'EMPLOYEE_DIRECTORY',
 'FAC_BUILDING',
 'FAC_BUILDING_ADDRESS',
 'FAC_ROOMS',
 'FCLT_BUILDING',
 'FCLT_BUILDING_ADDRESS_HIST',
 'FCLT_BUILDING_HIST',
 'FCLT_MAJOR_USE',
 'FCLT_ROOMS',
 'HR_ORG_UNIT',
 'HR_ORG_UNIT_NEW',
 'IAP_SUBJECT_CATEGORY',
 'IAP_SUBJECT_DETAIL',
 'IAP_SUBJECT_PERSON',
 'IAP_SUBJECT_SESSION',
 'LIBRARY_COURSE_INSTRUCTOR',
 'LIBRARY_MATERIAL_STATUS',
 'LIBRARY_RESERVE_CATALOG',
 'LIBRARY_RESERVE_MATRL_DETAIL',
 'LIBRARY_SUBJECT_OFFERED',
 'MIT_STUDENT_DIRECTORY',
 'SE_PERSON',
 'SPACE_DETAIL',
 'STUDENT_DEPARTMENT',
 'SUBJECT_ENROLLABLE',
 'SUBJECT_OFFERED',
 'SUBJECT_SUMMARY',
 'TIP_DETAIL',
 'TIP_MATERIAL',
 'TIP_MATERIAL_STATUS',
 'TIP_SUBJECT_OFFERED',
 'TOP_LEVEL_DOMAIN',
 'ZIP_CANADA',
 'ZIP_USA'}

In [12]:
len(unique_tables)

39

In [21]:
df_q

,question,sql,tables
0,How many organisation units in human resources are relabeled?,[SELECT COUNT(*) FROM (SELECT HR_ORG_UNIT_KEY FROM HR_ORG_UNIT_NEW INTERSECT SELECT HR_ORG_UNIT_KEY FROM HR_ORG_UNIT);],"[[HR_ORG_UNIT_NEW, HR_ORG_UNIT]]"
1,How many organisation units in human resources are new and not relabeled?,[SELECT COUNT(*) FROM (SELECT HR_ORG_UNIT_KEY FROM HR_ORG_UNIT_NEW MINUS SELECT HR_ORG_UNIT_KEY FROM HR_ORG_UNIT);],"[[HR_ORG_UNIT_NEW, HR_ORG_UNIT]]"
2,COUNT the number of courses offered by each department.,"[SELECT OFFER_DEPT_CODE, COUNT(*) AS COURSE_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE;]",[[SUBJECT_ENROLLABLE]]
3,"What are the past, upcoming, and current courses?","[SELECT DISTINCT SUBJECT_TITLE, ACADEMIC_TERMS.TERM_CODE, CASE WHEN TERM_START_DATE > SYSDATE THEN 'UPCOMING' WHEN TERM_START_DATE <= SYSDATE AND TERM_END_DATE > SYSDATE THEN 'CURRENT' ELSE 'PAST' END AS TERM_STATUS FROM SUBJECT_SUMMARY, ACADEMIC_TERMS WHERE SUBJECT_SUMMARY.TERM_CODE = ACADEMIC_TERMS.TERM_CODE;]","[[SUBJECT_SUMMARY, ACADEMIC_TERMS]]"
4,Which faculty has had the most location changes?,[SELECT MAX(CNT) FROM (SELECT COUNT(*) AS CNT FROM FCLT_BUILDING_ADDRESS_HIST GROUP BY FCLT_BUILDING_KEY);],[[FCLT_BUILDING_ADDRESS_HIST]]
5,What is the average number of courses a student can enroll in?,"[SELECT AVG(CNT) FROM (SELECT COUNT(*) AS CNT FROM MIT_STUDENT_DIRECTORY, SUBJECT_SUMMARY WHERE DEPARTMENT_CODE = DEPARTMENT GROUP BY FULL_NAME);]","[[MIT_STUDENT_DIRECTORY, SUBJECT_SUMMARY]]"
6,Which students are employed by mit?,"[SELECT DISTINCT EMPL.FULL_NAME FROM MIT_STUDENT_DIRECTORY MIT, EMPLOYEE_DIRECTORY EMPL WHERE EMPL.FULL_NAME = MIT.FULL_NAME;]","[[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]]"
7,What is the shortest course available this semester?,"[SELECT DISTINCT SUBJECT_TITLE, TERM_END_DATE - TERM_START_DATE FROM (SELECT MIN(TERM_END_DATE - TERM_START_DATE) AS MIN_DURATION FROM ACADEMIC_TERMS), ACADEMIC_TERMS, SUBJECT_SUMMARY WHERE SUBJECT_SUMMARY.TERM_CODE = ACADEMIC_TERMS.TERM_CODE AND TERM_END_DATE - TERM_START_DATE = MIN_DURATION;]","[[ACADEMIC_TERMS, SUBJECT_SUMMARY]]"
8,Show buildings and their address.,"[SELECT FB.BUILDING_NAME, FBA.* FROM FAC_BUILDING FB INNER JOIN FAC_BUILDING_ADDRESS FBA ON FB.FAC_BUILDING_KEY = FBA.BUILDING_KEY;]","[[FAC_BUILDING, FAC_BUILDING_ADDRESS]]"
9,How many students do we have?,[SELECT COUNT(*) FROM MIT_STUDENT_DIRECTORY;],[[MIT_STUDENT_DIRECTORY]]
10,Show all statuses for materials?,[SELECT DISTINCT LIBRARY_MATERIAL_STATUS FROM LIBRARY_MATERIAL_STATUS UNION SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_MATERIAL_STATUS;],"[[LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]]"
11,What are the different cities WHERE people live?,[SELECT DISTINCT CITY_NAME FROM ZIP_USA UNION SELECT DISTINCT CITY_NAME FROM ZIP_CANADA;],"[[ZIP_USA, ZIP_CANADA]]"
12,Give the average number of courses in one department with more than 100 courses.,"[SELECT AVG(OFFERED_SUBJECT_NR) FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS OFFERED_SUBJECT_NR FROM SUBJECT_SUMMARY) WHERE OFFERED_SUBJECT_NR >= 100;]",[[SUBJECT_SUMMARY]]
13,Count the number of rooms in a building.,"[SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM FCLT_ROOMS, FCLT_BUILDING WHERE FCLT_ROOMS.FCLT_BUILDING_KEY = FCLT_BUILDING.FCLT_BUILDING_KEY;]","[[FCLT_ROOMS, FCLT_BUILDING]]"
14,Count the number of space-units per building.,"[SELECT DISTINCT BUILDING_NAME_LONG, NUM_SPACES FROM (SELECT BUILDING_KEY, COUNT(*) OVER (PARTITION BY BUILDING_KEY) AS NUM_SPACES FROM SPACE_DETAIL) SD, FAC_BUILDING WHERE FAC_BUILDING.FAC_BUILDING_KEY = SD.BUILDING_KEY;]","[[SPACE_DETAIL, FAC_BUILDING]]"
15,"For courses that have descriptions of Regular and Initial, what are their start dates?","[SELECT SUBJECT_TITLE, TERM_START_DATE FROM (SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE SUBJECT_DESCRIPTION LIKE '%REGULAR%' OR SUBJECT_DESCRIPTION LIKE '%INITIAL%') COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL WHERE COURSE_CATALOG_SUBJECT_OFFERED.EFFECTIVE_TERM_CODE = ACADEMIC_TERMS_ALL.TERM_CODE;]","[[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL]]"
16,What are the names of the 3 departments which offer the most courses per semester?,"[SELECT * FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS NUMCOURSES FROM SUBJECT_SUMMARY ORDER BY NUMCOURSES DESC) WHERE ROWNUM <= 3;]",[[SUBJECT_SUMMARY]]
17,WHERE is Prof. Michael Stonebraker's office?,"[SELECT ROOM, FLOOR, FAC_BUILDING_ADDRESS.* FROM (SELECT OFFICE_LOCATION FROM EMPLOYEE_DIRECTORY WHERE FULL_NAME = 'STONEBRAKER, MICHAEL'), FAC_ROOMS, FAC_BUILDING_ADDRESS WHERE OFFICE_LOCATION = FAC_ROOM_KEY AND FAC_ROOMS.BUILDING_KEY = FAC_BUILDING_ADDRESS.BUILDING_KEY;]","[[EMPLOYEE_DIRECTORY, FAC_ROOMS, FAC_BUILDING_ADDRESS]]"
18,Which employees at MIT have a namesake?,"[SELECT DISTINCT MIT_ID, EMPLOYEE.* FROM (SELECT FULL_NAME, COUNT(*) OVER (PARTITION BY FULL_NAME) AS CNT FROM EMPLOYEE_DIRECTORY) EMPLOYEE, EMPLOYEE_DIRECTORY WHERE EMPLOYEE.FULL_NAME = EMPLOYEE_DIRECTORY.FULL_NAME AND CNT >= 2 ORDER BY EMPLOYEE.FULL_NAME;]",[[EMPLOYEE_DIRECTORY]]
19,Show the name for subjects which are enrollable for Computer Science Students.,[SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE DEPARTMENT_NAME = 'ELECTRICAL ENG & COMPUTER SCI';],[[SUBJECT_SUMMARY]]
20,How many students does each department have?,"[SELECT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) FROM MIT_STUDENT_DIRECTORY;]",[[MIT_STUDENT_DIRECTORY]]
21,What categories are there for independent activities periods?,[SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;],[[IAP_SUBJECT_CATEGORY]]
22,Find the city with the post code 501.,"[SELECT COUNT(*) FROM ((SELECT ZIP_CODE, CITY_NAME FROM ZIP_USA) UNION (SELECT POSTAL_CODE, CITY_NAME FROM ZIP_CANADA)) WHERE ZIP_CODE = '00501';]","[[ZIP_USA, ZIP_CANADA]]"
23,How many employees are there all in all?,[SELECT COUNT(DISTINCT MIT_ID) FROM EMPLOYEE_DIRECTORY;],[[EMPLOYEE_DIRECTORY]]
24,How many departments does each school have?,"[SELECT DISTINCT SCHOOL_NAME, COUNT(DEPARTMENT_NAME) OVER (PARTITION BY SCHOOL_NAME) FROM STUDENT_DEPARTMENT;]",[[STUDENT_DEPARTMENT]]
25,"Show the name, kerberos credentials, and email for the employee with the name 'Michael'.","[SELECT FULL_NAME, KRB_NAME, EMAIL_ADDRESS FROM EMPLOYEE_DIRECTORY WHERE FIRST_NAME = 'MICHAEL';]",[[EMPLOYEE_DIRECTORY]]
26,Show the school with the largest number of departments.,"[SELECT * FROM (SELECT * FROM (SELECT DISTINCT SCHOOL_NAME, COUNT(DEPARTMENT_NAME) OVER (PARTITION BY SCHOOL_NAME) AS CNT FROM STUDENT_DEPARTMENT) ORDER BY CNT DESC) WHERE ROWNUM <= 1;]",[[STUDENT_DEPARTMENT]]
27,What are the courses with the maximum number of units?,"[SELECT * FROM SUBJECT_SUMMARY, (SELECT MAX(TOTAL_UNITS) AS MAXI FROM SUBJECT_SUMMARY) WHERE TOTAL_UNITS = MAXI;]",[[SUBJECT_SUMMARY]]
28,What is the TDL for Brazil?,[SELECT * FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN_DESCRIPTION = 'BRAZIL';],[[TOP_LEVEL_DOMAIN]]
29,What are all the different start dates of courses of computer science that lasted less than 100 days?,"[SELECT DISTINCT * FROM (SELECT SUBJECT_TITLE, DEPARTMENT_NAME, TERM_START_DATE, TERM_END_DATE - TERM_START_DATE AS DURATION FROM SUBJECT_SUMMARY A, ACADEMIC_TERMS B WHERE A.TERM_CODE = B.TERM_CODE AND DEPARTMENT_NAME = 'ELECTRICAL ENG & COMPUTER SCI') WHERE DURATION <= 100;]","[[SUBJECT_SUMMARY, ACADEMIC_TERMS]]"
30,List the courses and format for all courses that have a number of attendees greater than 800.,"[SELECT DISTINCT SUBJECT_TITLE, FORM_TYPE, NUM_ENROLLED_STUDENTS FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 800;]",[[SUBJECT_OFFERED]]
31,Which textbook-material is used the most often?,"[SELECT * FROM (SELECT * FROM (SELECT C.TITLE, C.ISBN, COUNT(*) OVER (PARTITION BY C.TITLE, C.ISBN) AS CNT FROM TIP_DETAIL A, TIP_SUBJECT_OFFERED B, TIP_MATERIAL C WHERE IS_NO_COURSE_MATERIAL LIKE 'N' AND A.TIP_SUBJECT_OFFERED_KEY = B.TIP_SUBJECT_OFFERED_KEY AND A.TIP_MATERIAL_KEY = C.TIP_MATERIAL_KEY) ORDER BY CNT DESC) WHERE ROWNUM <= 1;]","[[TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]]"
32,"Show activity title, location, and supervisor for all independent activities ordered by start-date.","[SELECT DISTINCT ACTIVITY_TITLE, SESSION_LOCATION, TERM_START_DATE, PERSON_NAME AS LEADER FROM IAP_SUBJECT_DETAIL A, IAP_SUBJECT_PERSON B, ACADEMIC_TERMS_ALL C, IAP_SUBJECT_SESSION D WHERE A.IAP_SUBJECT_PERSON_KEY = B.IAP_SUBJECT_PERSON_KEY AND A.IAP_SUBJECT_SESSION_KEY = D.IAP_SUBJECT_SESSION_KEY AND C.TERM_CODE = A.TERM_CODE AND B.PERSON_ROLE = 'ACTIVITY LEADER';]","[[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADEMIC_TERMS_ALL, IAP_SUBJECT_SESSION]]"
33,"What are the titles and isbn numbers for all materials, sorted in ascending order of their price?","[SELECT DISTINCT TITLE, ISBN, NEW_SHELF_PRICE FROM TIP_MATERIAL ORDER BY NEW_SHELF_PRICE ASC;]",[[TIP_MATERIAL]]
34,Which were the first registered subjects?,"[SELECT SUBJECT_TITLE FROM COURSE_CATALOG_SUBJECT_OFFERED C, ACADEMIC_TERMS D, (SELECT MIN(ACADEMIC_YEAR) AS MINI FROM COURSE_CATALOG_SUBJECT_OFFERED) WHERE C.EFFECTIVE_TERM_CODE = D.TERM_CODE AND D.ACADEMIC_YEAR = MINI;]","[[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS]]"
35,How many departments have less than 300 students?,"[SELECT COUNT(*) FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS CNT FROM MIT_STUDENT_DIRECTORY) WHERE CNT <= 300;]",[[MIT_STUDENT_DIRECTORY]]
36,Which department has the most kinds of payroll ranks?,"[SELECT * FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(DISTINCT PAYROLL_RANK) OVER (PARTITION BY DEPARTMENT_NAME) AS CNT FROM SE_PERSON A, EMPLOYEE_DIRECTORY B WHERE A.MIT_ID = B.MIT_ID) A, (SELECT MAX(CNT) AS M FROM ((SELECT DISTINCT DEPARTMENT_NAME, COUNT(DISTINCT PAYROLL_RANK) OVER (PARTITION BY DEPARTMENT_NAME) AS CNT FROM SE_PERSON A, EMPLOYEE_DIRECTORY B WHERE A.MIT_ID = B.MIT_ID)) ) B WHERE A.CNT = B.M;]","[[SE_PERSON, EMPLOYEE_DIRECTORY]]"
37,List email adress and names of student and employee whose first name is Carole.,"[SELECT DISTINCT FULL_NAME, EMAIL_ADDRESS FROM (SELECT DISTINCT FIRST_NAME, FULL_NAME, EMAIL_ADDRESS FROM MIT_STUDENT_DIRECTORY UNION SELECT DISTINCT FIRST_NAME, FULL_NAME, EMAIL_ADDRESS FROM EMPLOYEE_DIRECTORY) WHERE FIRST_NAME = 'CAROLE';]","[[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]]"
38,what are the different payment roll ranks?,[SELECT DISTINCT PAYROLL_RANK FROM SE_PERSON;],[[SE_PERSON]]
39,List buildings which were build before 1950 and have more than 100 employees.,"[SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, YEAR_BUILT, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG, YEAR_BUILT) AS NUM_EMPLOYEES FROM ( SELECT * FROM (SELECT DISTINCT FCLT_BUILDING_KEY, BUILDING_NAME_LONG, EXTRACT(YEAR FROM TO_DATE(DATE_BUILT, 'MM/DD/YYYY')) AS YEAR_BUILT FROM FCLT_BUILDING_HIST) WHERE YEAR_BUILT <= 1950) A, FCLT_ROOMS, EMPLOYEE_DIRECTORY WHERE OFFICE_LOCATION = BUILDING_ROOM AND FCLT_ROOMS.FCLT_BUILDING_KEY = A.FCLT_BUILDING_KEY) WHERE NUM_EMPLOYEES >100;]","[[FCLT_BUILDING_HIST, FCLT_ROOMS, EMPLOYEE_DIRECTORY]]"
40,How many courses are there in the centre for international studies?,[SELECT COUNT(DISTINCT SUBJECT_ID) FROM CIS_COURSE_CATALOG;],[[CIS_COURSE_CATALOG]]
41,What is the number of offered courses WHERE more than 100 students are enrolled?,[SELECT COUNT(DISTINCT SUBJECT_ID) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;],[[SUBJECT_OFFERED]]
42,Who is sharing his office with at least one other person?,"[SELECT DISTINCT MIT_ID, FULL_NAME, A.OFFICE_LOCATION, NUM_EMPLOYEES FROM DRUPAL_EMPLOYEE_DIRECTORY A, (SELECT OFFICE_LOCATION, COUNT(MIT_ID) OVER(PARTITION BY OFFICE_LOCATION) AS NUM_EMPLOYEES FROM (SELECT MIT_ID, OFFICE_LOCATION FROM DRUPAL_EMPLOYEE_DIRECTORY UNION SELECT FULL_NAME, OFFICE_LOCATION FROM MIT_STUDENT_DIRECTORY)) B WHERE B.NUM_EMPLOYEES>= 2 AND B.OFFICE_LOCATION = A.OFFICE_LOCATION;]","[[DRUPAL_EMPLOYEE_DIRECTORY, MIT_STUDENT_DIRECTORY]]"
43,List the subject-groups and their number of courses which start in March?,"[SELECT DISTINCT CLUSTER_LIST, COUNT(SUBJECT_ID) OVER (PARTITION BY CLUSTER_LIST) FROM SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL WHERE EXTRACT(MONTH FROM TERM_START_DATE) = 3;]","[[SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]]"
44,"List course instructors, their courses and the amount of material for them.","[SELECT DISTINCT INSTRUCTOR_NAME, SUBJECT_TITLE, COUNT(CATALOG_ISBN) OVER (PARTITION BY INSTRUCTOR_NAME, SUBJECT_TITLE) FROM LIBRARY_COURSE_INSTRUCTOR, LIBRARY_RESERVE_MATRL_DETAIL, LIBRARY_SUBJECT_OFFERED, LIBRARY_RESERVE_CATALOG WHERE LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_COURSE_INSTRUCTOR_KEY AND LIBRARY_RESERVE_CATALOG.LIBRARY_RESERVE_CATALOG_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_RESERVE_CATALOG_KEY AND LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY;]","[[LIBRARY_COURSE_INSTRUCTOR, LIBRARY_RESERVE_MATRL_DETAIL, LIBRARY_SUBJECT_OFFERED, LIBRARY_RESERVE_CATALOG]]"
45,Which building accomodates the most students?,"[SELECT * FROM( SELECT * FROM( SELECT DISTINCT BUILDING_NAME, NUM_STUDENTS FROM (SELECT FCLT_BUILDING_KEY, COUNT(FULL_NAME) OVER (PARTITION BY FCLT_BUILDING_KEY) AS NUM_STUDENTS FROM FCLT_ROOMS, MIT_STUDENT_DIRECTORY WHERE OFFICE_LOCATION=BUILDING_ROOM) A, FCLT_BUILDING WHERE A.FCLT_BUILDING_KEY = FCLT_BUILDING.FCLT_BUILDING_KEY) ORDER BY NUM_STUDENTS DESC)WHERE ROWNUM <= 1;]","[[FCLT_ROOMS, MIT_STUDENT_DIRECTORY, FCLT_BUILDING]]"
46,Which building has on average the most rooms per floor?,"[SELECT * FROM(SELECT DISTINCT BUILDING_NAME, NUM_ROOMS/NUM_FLOORS FROM( SELECT FCLT_BUILDING_KEY, COUNT(DISTINCT FCLT_FLOOR_KEY) OVER (PARTITION BY FCLT_BUILDING_KEY) AS NUM_FLOORS, COUNT(DISTINCT FCLT_ROOM_KEY) OVER (PARTITION BY FCLT_BUILDING_KEY) AS NUM_ROOMS FROM FCLT_ROOMS) A, FCLT_BUILDING WHERE A.FCLT_BUILDING_KEY = FCLT_BUILDING.FCLT_BUILDING_KEY ORDER BY NUM_ROOMS/NUM_FLOORS DESC) WHERE ROWNUM <= 1;]","[[FCLT_ROOMS, FCLT_BUILDING]]"
47,What is the most common usage for all rooms.,"[SELECT * FROM(SELECT DISTINCT MAJOR_USE, NUM_ROOMS FROM (SELECT FCLT_MAJOR_USE_KEY, COUNT(FCLT_ROOM_KEY) OVER (PARTITION BY FCLT_MAJOR_USE_KEY) AS NUM_ROOMS FROM FCLT_ROOMS) A, FCLT_MAJOR_USE WHERE A.FCLT_MAJOR_USE_KEY = FCLT_MAJOR_USE.FCLT_MAJOR_USE_KEY ORDER BY NUM_ROOMS DESC) WHERE ROWNUM <= 1;]","[[FCLT_ROOMS, FCLT_MAJOR_USE]]"
48,Which IAP instructor has held the most sessions of the same course?,"[SELECT * FROM (SELECT DISTINCT PERSON_NAME, ACTIVITY_TITLE, COUNT(IAP_SUBJECT_SESSION_KEY) OVER (PARTITION BY PERSON_NAME,ACTIVITY_TITLE) AS NUM_SESSION FROM IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON WHERE IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY) ORDER BY NUM_SESSION DESC;]","[[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON]]"
49,What is the largest building?,"[SELECT * FROM(SELECT DISTINCT BUILDING_KEY, SUM(ROOM_SQUARE_FOOTAGE) OVER (PARTITION BY BUILDING_KEY) AS TOTAL_SQUARE_FOOTAGE FROM SPACE_DETAIL) ORDER BY TOTAL_SQUARE_FOOTAGE DESC;]",[[SPACE_DETAIL]]

In [18]:
#df_q = pd.concat([df_q, new_df], ignore_index=True)
df_q[['question', 'sql', 'tables', 'gpt_sql_nocontext','gpt_sql_global_schema']]

,question,sql,tables,gpt_sql_nocontext,gpt_sql_global_schema
0,What do I have access to in the warehouse?,[SELECT * FROM ALL_VIEWS WHERE OWNER = 'WAREUSER';],[[ALL_VIEWS]],"[This question cannot be answered with a SQL query as it requires administrative access to the MIT Data Warehouse system. The access to the warehouse is determined by the user's role and permissions, which are managed by the system administrators.]","[SELECT * FROM HR_ORG_UNIT, SELECT * FROM TIP_SUBJECT_OFFERED, SELECT * FROM FAC_ROOMS, SELECT * FROM TIP_DETAIL, SELECT * FROM CIS_COURSE_CATALOG, SELECT * FROM EMPLOYEE_DIRECTORY, SELECT * FROM FAC_BUILDING, SELECT * FROM ACADEMIC_TERMS, SELECT * FROM FAC_ORGANIZATION, SELECT * FROM SPACE_SUPERVISOR_USAGE]"
1,How much space does department of engineering have?,"[SELECT HOU.HR_DEPARTMENT_NAME, FAC_BUILDING_KEY, FB.BUILDING_NUMBER, FR.FAC_ROOM_KEY, FR.ROOM, FR.AREA FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE WHERE HOU.HR_DEPARTMENT_NAME = 'School of Engineering';]","[[FAC_BUILDING, FAC_ROOMS, FAC_ORGANIZATION, HR_ORG_UNIT]]","[SELECT SUM(space_square_feet) FROM mit_space_data WHERE department = 'Engineering', SELECT SUM(area) FROM mit_building_data WHERE department = 'Engineering']","[SELECT SUM(AREA) FROM FAC_ROOMS WHERE DEPT_CODE IN (SELECT HR_DEPARTMENT_CODE FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_NAME LIKE '%Engineering%'), SELECT SUM(ASSIGNABLE_AREA) FROM FAC_BUILDING WHERE BUILDING_NUMBER IN (SELECT BUILDING_KEY FROM FAC_ROOMS WHERE DEPT_CODE IN (SELECT HR_DEPARTMENT_CODE FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_NAME LIKE '%Engineering%'))]"
2,How much space does each department have?,"[SELECT HOU.HR_DEPARTMENT_NAME , SUM(FR.AREA) TOTAL_AREA_PER_BUILDING FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE GROUP BY HOU.HR_DEPARTMENT_NAME;]","[[FAC_BUILDING, FAC_ROOMS, FAC_ORGANIZATION, HR_ORG_UNIT]]","[SELECT department_id, SUM(space) AS total_space FROM department_space GROUP BY department_id, SELECT d.department_name, SUM(s.space) AS total_space FROM department_space s JOIN departments d ON s.department_id = d.department_id GROUP BY d.department_name]","[SELECT DEPT_CODE, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS GROUP BY DEPT_CODE, SELECT ORGANIZATION_NAME, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS FR JOIN FAC_ORGANIZATION FO ON FR.ORGANIZATION_KEY = FO.ORGANIZATION_KEY GROUP BY ORGANIZATION_NAME, SELECT HR_DEPARTMENT_NAME, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS FR JOIN HR_ORG_UNIT HR ON FR.DEPT_CODE = HR.HR_DEPARTMENT_CODE GROUP BY HR_DEPARTMENT_NAME, SELECT DEPARTMENT_NAME, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS FR JOIN EMPLOYEE_DIRECTORY ED ON FR.DEPT_CODE = ED.DEPARTMENT_NUMBER GROUP BY DEPARTMENT_NAME, SELECT DEPARTMENT_NAME, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS FR JOIN CIS_COURSE_CATALOG CC ON FR.DEPT_CODE = CC.DEPARTMENT_CODE GROUP BY DEPARTMENT_NAME]"
3,How much space does each department have in each building?,"[SELECT HOU.HR_DEPARTMENT_NAME , FB.BUILDING_NUMBER , SUM(FR.AREA) TOTAL_AREA_PER_BUILDING FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE GROUP BY HOU.HR_DEPARTMENT_NAME, FB.BUILDING_NUMBER ORDER BY HOU.HR_DEPARTMENT_NAME;]","[[FAC_BUILDING, FAC_ROOMS, FAC_ORGANIZATION, HR_ORG_UNIT]]","[SELECT Department, Building, SUM(Space) AS TotalSpace FROM DepartmentSpaceTable GROUP BY Department, Building, SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Departments d JOIN Spaces s ON d.DepartmentID = s.DepartmentID JOIN Buildings b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName, SELECT Department, Building, SUM(Space) AS TotalSpace FROM Department_Building_Space GROUP BY Department, Building, SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Department d INNER JOIN Space s ON d.DepartmentID = s.DepartmentID INNER JOIN Building b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName]","[SELECT DEPT_CODE, BUILDING_KEY, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS GROUP BY DEPT_CODE, BUILDING_KEY]"
4,What how many rooms per building for a department and what is the total count per building?,"[SELECT HOU.HR_DEPARTMENT_NAME , FB.BUILDING_NUMBER , COUNT(FR.ROOM) OVER (PARTITION BY HOU.HR_DEPARTMENT_NAME, FB.BUILDING_NUMBER ) AS ROOMS_PER_DEPT_PER_BUILDING , FR.ROOM FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE WHERE HOU.HR_DEPARTMENT_NAME = 'School of Engineering';]","[[FAC_BUILDING, FAC_ROOMS, FAC_ORGANIZATION, HR_ORG_UNIT]]","[SELECT BUILDING_ID, COUNT(ROOM_ID) AS ROOM_COUNT FROM ROOMS WHERE DEPARTMENT_ID = 'your_department_id' GROUP BY BUILDING_ID, SELECT BUILDING_ID, COUNT(ROOM_ID) AS TOTAL_ROOM_COUNT FROM ROOMS GROUP BY BUILDING_ID]","[SELECT FAC_BUILDING.BUILDING_NUMBER, COUNT(FAC_ROOMS.ROOM), SUM(FAC_ROOMS.AREA) FROM FAC_BUILDING JOIN FAC_ROOMS ON FAC_BUILDING.BUILDING_KEY = FAC_ROOMS.BUILDING_KEY WHERE FAC_ROOMS.DEPT_CODE = 'department_code' GROUP BY FAC_BUILDING.BUILDING_NUMBER]"
5,What is each room used for?,"[SELECT FR.FAC_ROOM_KEY , FR.BUILDING_KEY , FR.FLOOR , FR.ROOM , FR.SPACE_ID , FR.MAJOR_USE_KEY , FR.USE_KEY , FR.USE_DESC , FR.ORGANIZATION_NAME , FR.AREA , FR.WAREHOUSE_LOAD_DATE FROM WAREUSER.FAC_ROOMS FR JOIN WAREUSER.FAC_BUILDING FB ON FR.BUILDING_KEY = FB.FAC_BUILDING_KEY AND FB.SITE = 'MIT' AND (FR.FAC_ROOM_KEY LIKE '%T' OR FR.USE_DESC = 'TELE');]","[[FAC_ROOMS, FAC_BUILDING]]","[SELECT room_number, room_use FROM room_usage, SELECT room_id, usage_description FROM room_details, SELECT room_name, purpose FROM room_information]","[SELECT ROOM, MAJOR_USE_DESC FROM FAC_ROOMS]"
6,Where is the geo tag for each room?,"[ SELECT LATITUDE_WGS , LONGITUDE_WGS FROM WAREUSER.FAC_BUILDING;]",[[FAC_BUILDING]],"[SELECT room_number, geo_tag FROM room_table, SELECT room_id, geo_location FROM room_info, SELECT room, geotag FROM building_rooms]","[SELECT ROOM, LATITUDE_WGS, LONGITUDE_WGS FROM FAC_ROOMS]"
7,How old is a building?,[SELECT DATE_BUILT FROM WAREUSER.FAC_BUILDING;],[[FAC_BUILDING]],"[SELECT CURRENT_DATE - construction_date AS building_age FROM buildings WHERE building_name = 'Building Name', SELECT YEAR(CURRENT_DATE) - YEAR(construction_date) AS building_age FROM buildings WHERE building_name = 'Building Name', SELECT DATEDIFF(YEAR, construction_date, CURRENT_DATE) AS building_age FROM buildings WHERE building_name = 'Building Name']","[SELECT BUILDING_NAME, DATE_BUILT, (YEAR(CURRENT_DATE) - YEAR(DATE_BUILT)) AS BUILDING_AGE FROM FAC_BUILDING]"
8,How much square footage does everything supervise,[SELECT * FROM WAREUSER.SPACE_SUPERVISOR_USAGE SSU JOIN EMPLOYEE_DIRECTORY ED ON ED.MIT_ID = SSU.MIT_ID;],"[[SPACE_SUPERVISOR_USAGE, EMPLOYEE_DIRECTORY]]",[SELECT SUM(square_footage) FROM building],[SELECT SUM(SQFT) FROM SPACE_SUPERVISOR_USAGE]
9,What year had the biggest year over year increase in building?,"[WITH BUILDING_COUNT AS ( SELECT EXTRACT(YEAR FROM TO_DATE(CY_FB.DATE_BUILT, 'MM/DD/YYYY')) AS YEAR_BUILT, COUNT(CY_FB.BUILDING_NUMBER) AS NUMBER_OF_BUILDINGS FROM WAREUSER.FAC_BUILDING CY_FB WHERE CY_FB.DATE_BUILT IS NOT NULL GROUP BY EXTRACT(YEAR FROM TO_DATE(CY_FB.DATE_BUILT, 'MM/DD/YYYY'))), PREVIOUS_YEAR_COUNTS AS ( SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , NVL(LAG(NUMBER_OF_BUILDINGS) OVER (ORDER BY YEAR_BUILT), 0) AS PREVIOUS_YEAR_COUNT , NUMBER_OF_BUILDINGS - NVL(LAG(NUMBER_OF_BUILDINGS) OVER (ORDER BY YEAR_BUILT), 0) AS YEAR_OVER_YEAR_COUNT FROM BUILDING_COUNT), MAX_YEAR_OVER_YEAR AS ( SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , PREVIOUS_YEAR_COUNT , YEAR_OVER_YEAR_COUNT , MAX(YEAR_OVER_YEAR_COUNT) OVER (PARTITION BY 1) AS MAX_YEAR_OVER_YEAR_COUNT FROM PREVIOUS_YEAR_COUNTS) SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , PREVIOUS_YEAR_COUNT , YEAR_OVER_YEAR_COUNT FROM MAX_YEAR_OVER_YEAR WHERE MAX_YEAR_OVER_YEAR_COUNT = YEAR_OVER_YEAR_COUNT;]",[[FAC_BUILDING]],"[SELECT YEAR, MAX(YEAR_OVER_YEAR_INCREASE) FROM (SELECT YEAR, (BUILDING_COUNT - LAG(BUILDING_COUNT) OVER (ORDER BY YEAR)) AS YEAR_OVER_YEAR_INCREASE FROM (SELECT DATE_PART('year', BUILDING_DATE) AS YEAR, COUNT(*) AS BUILDING_COUNT FROM BUILDING GROUP BY DATE_PART('year', BUILDING_DATE))) AS SUBQUERY, SELECT YEAR FROM (SELECT YEAR, (BUILDING_COUNT - LAG(BUILDING_COUNT) OVER (ORDER BY YEAR)) AS YEAR_OVER_YEAR_INCREASE FROM (SELECT EXTRACT(YEAR FROM BUILDING_DATE) AS YEAR, COUNT(*) AS BUILDING_COUNT FROM BUILDING GROUP BY EXTRACT(YEAR FROM BUILDING_DATE))) ORDER BY YEAR_OVER_YEAR_INCREASE DESC LIMIT 1]","[SELECT YEAR FROM (SELECT DATE_BUILT AS YEAR, COUNT(FAC_BUILDING_KEY) AS NUM_BUILDINGS, COUNT(FAC_BUILDING_KEY) - LAG(COUNT(FAC_BUILDING_KEY), 1) OVER (ORDER BY DATE_BUILT) AS YOY_INCREASE FROM FAC_BUILDING GROUP BY DATE_BUILT ORDER BY YOY_INCREASE DESC) WHERE ROWNUM = 1]"
10,What percent of courses have submitted TIP data for a given term code?,"[WITH SUBJECT AS ( SELECT TIP_SUBJECT_OFFERED.SUBJECT_ID SUBJECT_ID , TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL IS_NO_COURSE_MATERIAL , TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE OFFER_DEPT_CODE , TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME OFFER_DEPT_NAME , TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME OFFER_SCHOOL_NAME , ACADEMIC_TERMS.TERM_CODE TERM_CODE , ACADEMIC_TERMS.TERM_SELECTOR TERM_SELECTOR , CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END AS SUBMITTED , TIP_SUBJECT_OFFERED.SUBJECT_TITLE SUBJECT_TITLE , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID MASTER_SUBJECT_ID , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER MASTER_COURSE_NUMBER , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC MASTER_COURSE_NUMBER_DESC , TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME RESPONSIBLE_FACULTY_NAME , LOWER(KRB_PERSON.EMAIL_ADDRESS) c14 , SUM(TIP_SUBJECT_OFFERED.NUM_ENROLLED_STUDENTS) NUM_ENROLLED_STUDENTS , TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT MASTER_SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT COURSE_NUMBER_SORT , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT MASTER_COURSE_NUMBER_SORT , NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL) FALL_INSTRUCTORS , NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) SPRING_INSTRUCTORS , 'summary' AS SHOWSUMMARY , 'allcourses' AS SHOWALLCOURSES , 'SUBMITTED' AS SHOWSUBMITTED , 'notSUBMITTED' AS SHOWNOTSUBMITTED FROM WAREUSER.ACADEMIC_TERMS ACADEMIC_TERMS JOIN WAREUSER.TIP_SUBJECT_OFFERED TIP_SUBJECT_OFFERED ON ACADEMIC_TERMS.TERM_CODE = TIP_SUBJECT_OFFERED.TERM_CODE LEFT JOIN WAREUSER.TIP_DETAIL TIP_DETAIL ON TIP_SUBJECT_OFFERED.TIP_SUBJECT_OFFERED_KEY = TIP_DETAIL.TIP_SUBJECT_OFFERED_KEY LEFT JOIN WAREUSER.EMPLOYEE_DIRECTORY KRB_PERSON ON TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_MIT_ID = KRB_PERSON.MIT_ID LEFT JOIN WAREUSER.CIS_COURSE_CATALOG CIS_COURSE_CATALOG ON TIP_SUBJECT_OFFERED.SUBJECT_ID = CIS_COURSE_CATALOG.SUBJECT_ID AND SUBSTR(TIP_SUBJECT_OFFERED.TERM_CODE, 1, 4) = CIS_COURSE_CATALOG.ACADEMIC_YEAR WHERE TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME IN ( 'Science' ) AND ACADEMIC_TERMS.TERM_CODE IN ( '2024SU' ) AND CIS_COURSE_CATALOG.TUITION_ATTRIBUTE IS NULL AND CIS_COURSE_CATALOG.SUPERVISOR_ATTRIBUTE IS NULL AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.NIV%' AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.UR%' GROUP BY TIP_SUBJECT_OFFERED.SUBJECT_ID, TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL, TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE, TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME, TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME, ACADEMIC_TERMS.TERM_CODE, ACADEMIC_TERMS.TERM_SELECTOR, CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END, TIP_SUBJECT_OFFERED.SUBJECT_TITLE, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC, TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME, LOWER(KRB_PERSON.EMAIL_ADDRESS), TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT, NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL), NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) HAVING TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE IN ( '9' ) ) SELECT TERM_SELECTOR , COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBJECT_COUNT , OFFER_DEPT_CODE , OFFER_SCHOOL_NAME , TERM_CODE , SHOWALLCOURSES , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBMITTED , SHOWSUBMITTED , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_SUBMITTED , COUNT(DISTINCT SUBJECT_ID) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME , TERM_CODE) AS NOT_SUBMITTED , SHOWNOTSUBMITTED , 1 - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_NOT_SUBMITTED , OFFER_DEPT_NAME FROM SUBJECT;]","[[ACADEMIC_TERMS, TIP_SUBJECT_OFFERED, TIP_DETAIL, EMPLOYEE_DIRECTORY, CIS_COURSE_CATALOG]]","[SELECT (COUNT(DISTINCT course_id)* 100.0 / (SELECT COUNT(*) FROM courses)) AS percentage FROM tip_data WHERE term_code = 'given_term_code', SELECT (COUNT(DISTINCT t.course_id)* 100.0 / (SELECT COUNT(*) FROM courses c)) AS percentage FROM tip_data t INNER JOIN courses c ON t.course_id = c.course_id WHERE t.term_code = 'given_term_code']",[SELECT (COUNT(DISTINCT TIP_SUBJECT_OFFERED.SUBJECT_ID) / (SELECT COUNT(DISTINCT CIS_COURSE_CATALOG.SUBJECT_ID) FROM CIS_COURSE_CATALOG WHERE CIS_COURSE_CATALOG.EFFECTIVE_TERM_CODE = 'given_term_code')) * 100 AS PERCENTAGE FROM TIP_SUBJECT_OFFERED WHERE TIP_SUBJECT_OFFERED.TERM_CODE = 'given_term_code']
11,What kind of questions can I ask the data warehoues?,"[SELECT DISTINCT ST.STAR_NAME, REPLACE (REPLACE (ST.DESCRIPTION, CHR(13)), CHR(10), ' ') AS STAR_DESCRIPTION, UV.VIEW_NAME, REPLACE (REPLACE (UV.DESCRIPTION, CHR(13)), CHR(10), ' ') AS VIEW_DESCRIPTION, F.FIELD_NAME, F.DEFINITION AS FIELD_DESCRIPTION FROM STAR ST JOIN STAR_USER_VIEW SAV ON ST.STAR_ID = SAV.STAR_ID JOIN USER_VIEW UV ON SAV.VIEW_ID = UV.VIEW_ID JOIN FIELDS F ON F.TABLE_NAME = UV.VIEW_NAME ORDER BY 1, 3, 4;]","[[STAR, STAR_USER_VIEW, USER_VIEW, FIELDS]]",[],[]

## Go thrugh the `unique_tables` list and save the respective schemas as proper CSV files

In [267]:
for t in unique_tables: 
    if t.upper().startswith('WAREUSER.'):
        t = t[len('WAREUSER.'):]
    schema_file = str(prefix) + '/data/views/schema/' + t + '.csv'
    if os.path.isfile(schema_file): 
        s = pd.read_csv(schema_file, header=None)
        s = s.drop(1) # delete the "header" line 
        column_names = [h.strip() for h in s[0][0].split(';')]
        s_new = pd.DataFrame(list(s[0][1:].apply(lambda row: [c.strip() for c in row.split(';')])), columns=column_names)
        new_schema_file = str(prefix) + '/data/views/schema_new/' + t + '.csv'
        s_new.to_csv(new_schema_file, index=False)

## Map tables to queries

In [13]:
queries = []
for t in unique_tables:
    q = set()
    for i, T in enumerate(df_q['tables']): 
        for j, T_ in enumerate(T):
            if t in T_: 
                q.add((i,j)) 
    queries.append(list(q))

In [14]:
queries

[[(48, 0), (32, 0)],
 [(44, 0)],
 [(4, 0)],
 [(44, 0)],
 [(9, 0), (42, 0), (37, 0), (45, 0), (35, 0), (20, 0), (5, 0), (6, 0)],
 [(15, 0), (34, 0)],
 [(2, 0)],
 [(42, 0)],
 [(32, 0)],
 [(49, 0), (14, 0)],
 [(1, 0), (0, 0)],
 [(22, 0), (11, 0)],
 [(36, 0), (38, 0)],
 [(39, 0)],
 [(43, 0), (15, 0), (32, 0)],
 [(48, 0), (32, 0)],
 [(21, 0)],
 [(1, 0), (0, 0)],
 [(10, 0)],
 [(17, 0), (8, 0)],
 [(8, 0), (14, 0)],
 [(28, 0)],
 [(17, 0)],
 [(45, 0), (13, 0), (46, 0)],
 [(45, 0), (13, 0), (46, 0), (47, 0), (39, 0)],
 [(10, 0)],
 [(25, 0), (37, 0), (17, 0), (23, 0), (18, 0), (36, 0), (6, 0), (39, 0)],
 [(40, 0)],
 [(31, 0)],
 [(31, 0)],
 [(33, 0), (31, 0)],
 [(47, 0)],
 [(44, 0)],
 [(26, 0), (24, 0)],
 [(16, 0),
  (12, 0),
  (7, 0),
  (29, 0),
  (19, 0),
  (3, 0),
  (5, 0),
  (27, 0),
  (43, 0)],
 [(7, 0), (29, 0), (34, 0), (3, 0)],
 [(22, 0), (11, 0)],
 [(44, 0)],
 [(30, 0), (41, 0)]]

In [15]:
df_t = pd.DataFrame(columns=['table', 'log'])
df_t['table'] = list(unique_tables)
df_t['log'] = queries
df_t

,table,log
0,IAP_SUBJECT_PERSON,"[(48, 0), (32, 0)]"
1,LIBRARY_RESERVE_MATRL_DETAIL,"[(44, 0)]"
2,FCLT_BUILDING_ADDRESS_HIST,"[(4, 0)]"
3,LIBRARY_SUBJECT_OFFERED,"[(44, 0)]"
4,MIT_STUDENT_DIRECTORY,"[(9, 0), (42, 0), (37, 0), (45, 0), (35, 0), (20, 0), (5, 0), (6, 0)]"
5,COURSE_CATALOG_SUBJECT_OFFERED,"[(15, 0), (34, 0)]"
6,SUBJECT_ENROLLABLE,"[(2, 0)]"
7,DRUPAL_EMPLOYEE_DIRECTORY,"[(42, 0)]"
8,IAP_SUBJECT_SESSION,"[(32, 0)]"
9,SPACE_DETAIL,"[(49, 0), (14, 0)]"
10,HR_ORG_UNIT,"[(1, 0), (0, 0)]"
11,ZIP_USA,"[(22, 0), (11, 0)]"
12,SE_PERSON,"[(36, 0), (38, 0)]"
13,FCLT_BUILDING_HIST,"[(39, 0)]"
14,ACADEMIC_TERMS_ALL,"[(43, 0), (15, 0), (32, 0)]"
15,IAP_SUBJECT_DETAIL,"[(48, 0), (32, 0)]"
16,IAP_SUBJECT_CATEGORY,"[(21, 0)]"
17,HR_ORG_UNIT_NEW,"[(1, 0), (0, 0)]"
18,LIBRARY_MATERIAL_STATUS,"[(10, 0)]"
19,FAC_BUILDING_ADDRESS,"[(17, 0), (8, 0)]"
20,FAC_BUILDING,"[(8, 0), (14, 0)]"
21,TOP_LEVEL_DOMAIN,"[(28, 0)]"
22,FAC_ROOMS,"[(17, 0)]"
23,FCLT_BUILDING,"[(45, 0), (13, 0), (46, 0)]"
24,FCLT_ROOMS,"[(45, 0), (13, 0), (46, 0), (47, 0), (39, 0)]"
25,TIP_MATERIAL_STATUS,"[(10, 0)]"
26,EMPLOYEE_DIRECTORY,"[(25, 0), (37, 0), (17, 0), (23, 0), (18, 0), (36, 0), (6, 0), (39, 0)]"
27,CIS_COURSE_CATALOG,"[(40, 0)]"
28,TIP_SUBJECT_OFFERED,"[(31, 0)]"
29,TIP_DETAIL,"[(31, 0)]"
30,TIP_MATERIAL,"[(33, 0), (31, 0)]"
31,FCLT_MAJOR_USE,"[(47, 0)]"
32,LIBRARY_RESERVE_CATALOG,"[(44, 0)]"
33,STUDENT_DEPARTMENT,"[(26, 0), (24, 0)]"
34,SUBJECT_SUMMARY,"[(16, 0), (12, 0), (7, 0), (29, 0), (19, 0), (3, 0), (5, 0), (27, 0), (43, 0)]"
35,ACADEMIC_TERMS,"[(7, 0), (29, 0), (34, 0), (3, 0)]"
36,ZIP_CANADA,"[(22, 0), (11, 0)]"
37,LIBRARY_COURSE_INSTRUCTOR,"[(44, 0)]"
38,SUBJECT_OFFERED,"[(30, 0), (41, 0)]"

# Treat ChatGPT as an all-knowing oracle (without any additional information)
## Prompt
_Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. 
The MIT Data Warehouse is a central data source that combines data from various administrative systems at 
MIT, containing information about students, faculty, and personnel. You can find more about the MIT data 
warehouse tables at https://web.mit.edu/warehouse/metadata/tables/all_tables.html._

_How many organisation units in human resources are relabeled?_

In [19]:
api_key = config['api-key']
client = OpenAI(api_key=api_key)

## Populate the prompt and call the Open AI API

In [18]:
headers = {
    'Content-Type': 'application/json',
    'Authorization': f'Bearer {api_key}'
}

response = requests.get('https://api.openai.com/v1/engines', headers=headers)

if response.status_code == 200:
    engines = response.json()['data']
    print("Available engines:")
    for engine in engines:
        print(engine['id'])
else:
    print("Error:", response.text)

Available engines:
gpt-3.5-turbo-16k-0613
whisper-1
davinci-002
gpt-3.5-turbo-16k
dall-e-2
tts-1-hd-1106
tts-1-hd
gpt-4
dall-e-3
gpt-4-1106-preview
gpt-4-0613
gpt-3.5-turbo-instruct-0914
gpt-3.5-turbo-instruct
tts-1
gpt-3.5-turbo-0613
gpt-3.5-turbo-0301
babbage-002
tts-1-1106
text-embedding-3-large
gpt-3.5-turbo
gpt-3.5-turbo-0125
gpt-4-1106-vision-preview
text-embedding-3-small
gpt-4-vision-preview
text-embedding-ada-002
gpt-4-turbo-2024-04-09
gpt-3.5-turbo-1106
gpt-4-turbo-preview
gpt-4-0125-preview
gpt-4-turbo

In [ ]:
# TODO: do this in batch 
gpt_sql_nocontext = []
for q in df_q['question']: 
    response = client.chat.completions.create(
        model="gpt-4",
        temperature=0,
        messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. You can find more about the MIT data warehouse tables at \
          https://web.mit.edu/warehouse/metadata/tables/all_tables.html. \
          Reply with as many answers \
          as you can think of in SQL and include no linebreaks, newlines, escape characters or other commentary for the each possible \
          answer, but seperate the possibilities by semicolons."
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
          },
            {"role":"user", 
             "content":q}]
    )
    gpt_sql_nocontext.append(response.choices[0].message.content)

In [246]:
sql_response = []
for q in gpt_sql_nocontext:
    sql_response.append(q.split(';'))
for i in range(len(sql_response)):
    if '' in sql_response[i]:sql_response[i] = sql_response[i][:-1]
sql_response

[["This question cannot be answered with a SQL query as it requires administrative access to the MIT Data Warehouse system. The access to the warehouse is determined by the user's role and permissions, which are managed by the system administrators."],
 ["SELECT SUM(space_square_feet) FROM mit_space_data WHERE department = 'Engineering'",
  " SELECT SUM(area) FROM mit_building_data WHERE department = 'Engineering'"],
 ['SELECT department_id, SUM(space) AS total_space FROM department_space GROUP BY department_id',
  ' SELECT d.department_name, SUM(s.space) AS total_space FROM department_space s JOIN departments d ON s.department_id = d.department_id GROUP BY d.department_name'],
 ['SELECT Department, Building, SUM(Space) AS TotalSpace FROM DepartmentSpaceTable GROUP BY Department, Building',
  ' SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Departments d JOIN Spaces s ON d.DepartmentID = s.DepartmentID JOIN Buildings b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName',
  ' SELECT Department, Building, SUM(Space) AS TotalSpace FROM Department_Building_Space GROUP BY Department, Building',
  ' SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Department d INNER JOIN Space s ON d.DepartmentID = s.DepartmentID INNER JOIN Building b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName'],
 ["SELECT BUILDING_ID, COUNT(ROOM_ID) AS ROOM_COUNT FROM ROOMS WHERE DEPARTMENT_ID = 'your_department_id' GROUP BY BUILDING_ID",
  ' SELECT BUILDING_ID, COUNT(ROOM_ID) AS TOTAL_ROOM_COUNT FROM ROOMS GROUP BY BUILDING_ID'],
 ['SELECT room_number, room_use FROM room_usage',
  ' SELECT room_id, usage_description FROM room_details',
  ' SELECT room_name, purpose FROM room_information'],
 ['SELECT room_number, geo_tag FROM room_table',
  ' SELECT room_id, geo_location FROM room_info',
  ' SELECT room, geotag FROM building_rooms'],
 ["SELECT CURRENT_DATE - construction_date AS building_age FROM buildings WHERE building_name = 'Building Name'",
  " SELECT YEAR(CURRENT_DATE) - YEAR(construction_date) AS building_age FROM buildings WHERE building_name = 'Building Name'",
  " SELECT DATEDIFF(YEAR, construction_date, CURRENT_DATE) AS building_age FROM buildings WHERE building_name = 'Building Name'"],
 ['SELECT SUM(square_footage) FROM building'],
 ["SELECT YEAR, MAX(YEAR_OVER_YEAR_INCREASE) FROM (SELECT YEAR, (BUILDING_COUNT - LAG(BUILDING_COUNT) OVER (ORDER BY YEAR)) AS YEAR_OVER_YEAR_INCREASE FROM (SELECT DATE_PART('year', BUILDING_DATE) AS YEAR, COUNT(*) AS BUILDING_COUNT FROM BUILDING GROUP BY DATE_PART('year', BUILDING_DATE))) AS SUBQUERY",
  'SELECT YEAR FROM (SELECT YEAR, (BUILDING_COUNT - LAG(BUILDING_COUNT) OVER (ORDER BY YEAR)) AS YEAR_OVER_YEAR_INCREASE FROM (SELECT EXTRACT(YEAR FROM BUILDING_DATE) AS YEAR, COUNT(*) AS BUILDING_COUNT FROM BUILDING GROUP BY EXTRACT(YEAR FROM BUILDING_DATE))) ORDER BY YEAR_OVER_YEAR_INCREASE DESC LIMIT 1'],
 ["SELECT (COUNT(DISTINCT course_id)* 100.0 / (SELECT COUNT(*) FROM courses)) AS percentage FROM tip_data WHERE term_code = 'given_term_code'",
  " SELECT (COUNT(DISTINCT t.course_id)* 100.0 / (SELECT COUNT(*) FROM courses c)) AS percentage FROM tip_data t INNER JOIN courses c ON t.course_id = c.course_id WHERE t.term_code = 'given_term_code'"]]

In [247]:
len(sql_response)

11

In [248]:
df_q['gpt_sql_nocontext']=sql_response

# Give ChatGPT the "database" schema as context and elicit its answer

In [16]:
def table_to_sql_create(t): 
    schema_file=str(prefix) + '/data/views/schema_new/' + t + '.csv'
    p = None
    if os.path.isfile(schema_file):
        df_t = pd.read_csv(schema_file)
        p = "CREATE TABLE "+ t+ "(\n"  
        p = p + '\n'.join(list(df_t[['COLUMN_NAME', 'DATA_TYPE']].apply(lambda row: ' '.join(row.astype(str)), axis=1)))
        p = p + ')\n'
    return p

In [17]:
prompt = "** all the tables in the database ** \n\n"
cnt = 0 
for t in unique_tables:
    if t.upper().startswith('WAREUSER.'):
        t = t[len('WAREUSER.'):]
    p = table_to_sql_create(t)
    if not p: 
        print(t)
    if p: 
        cnt = cnt + 1
        prompt = prompt + p
        prompt = prompt + "\n\n"

In [20]:
print(len(prompt))
additional_space = 3000-len(prompt)

20701

## Prompt
_Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. 
The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing 
information about students, faculty, and personnel. The schemas of all the tables that you might need 
for answering the user questions are below. There are 50 tables in the database.  Reply with as many answers 
as you can think of in SQL and include no linebreaks, newlines, escape characters or other commentary for the each possible 
answer, but seperate the possibilities by semicolons. + "alltable_schemas"_

In [ ]:
gpt_sql_global_schema = []
for q in df_q['question']: 
    response = client.chat.completions.create(
        model="gpt-4",
        temperature = 0,
        messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. The schemas of all the tables that you might need \
          for answering the user questions are below. There are 50 tables in the database.  Reply with as many answers \
           as you can think of in SQL and include no linebreaks, newlines, escape characters or other commentary for the each possible \
           answer, but seperate the possibilities by semicolons. \n\n" + prompt 
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
        },
          {"role":"user", 
           "content":q}]
          )
    gpt_sql_global_schema.append(response.choices[0].message.content)
    print(response.choices[0].message.content)

In [ ]:
sql_response = []
for q in gpt_sql_global_schema:
    sql_response.append(q.split(';'))
for i in range(len(sql_response)):
    if '' in sql_response[i]:sql_response[i] = sql_response[i][:-1]
sql_response

In [ ]:
df_q['gpt_sql_global_schema'] = sql_response

# Give ChatGPT the "database" schema and prev queries as context and elicit its answer
### Prompt
_Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. 
The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing 
information about students, faculty, and personnel. The schemas of the all the tables that you might need 
for answering the user questions are given below. There are 47 tables in the database. 
For each table, the schema of the table and the previous queries that referred to the table are also given. \
Reply with as many answers as you can think of in SQL and include no linebreaks, newlines, escape characters or other 
commentary for the each possible  answer, but seperate the possibilities by semicolons_

In [40]:
def table_to_sql_create_with_logs(t, l): 
    schema_file= str(prefix) + '/data/views/schema_new/' + t + '.csv'
    p = None
    p_ = None
    if os.path.isfile(schema_file):
        df_t_ = pd.read_csv(schema_file)
        p = "CREATE TABLE " + t + "(\n" 
        p = p + '\n'.join(list(df_t_[['COLUMN_NAME', 'DATA_TYPE']].apply(lambda row: ' '.join(row.astype(str)), axis=1)))
        p = p + ')\n'
        if l:
            p = p + "\n ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE {0} **\n\n".format(t)
            for (i,j) in l: 
                # p = p + "QUESTION: {0} \n".format(df_q['question'][i])
                # p = p + "SQL ANSWER: {0} \n\n".format(df_q['sql'][i])
                p = p + "SQL: {0} \n\n".format(df_q['sql'][i][j])
    return p

In [49]:
def create_prompt(curr_query_index): 
    prompt = "*** ALL THE TABLES IN THE DATABASE and QUERY LOGS *** \n"
    cnt = 0 
    for i, t in enumerate(unique_tables):
        l = set(df_t['log'][i]).difference([(curr_query_index, j) for j in range(len(df_q['sql'][curr_query_index]))])
        p = table_to_sql_create_with_logs(t, list(l))
        if not p:
            print(t)
        else: 
            cnt = cnt + 1
            prompt = prompt + p + "\n"
    return prompt

In [52]:
gpt_sql_log = []
for i, q in enumerate(df_q['question']): 
    prompt = create_prompt(i)
    print(prompt)
    response = client.chat.completions.create(
      model="gpt-4",
      messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. The schemas of the all the tables that you might need \
          for answering the user questions are given below. There are 47 tables in the database. \
          For each table, the schema of the table and the previous queries that referred to the table are also given. \
          \
          Reply with as many answers as you can think of in SQL and include no linebreaks, newlines, escape characters or other \
          commentary for the each possible  answer, but seperate the possibilities by semicolons. \n\n" + prompt 
          # prompt 
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
        },
          {"role":"user", 
           "content":q}]
          )
    print(response.choices[0].message.content)
    gpt_sql_log.append(response.choices[0].message.content)

*** ALL THE TABLES IN THE DATABASE and QUERY LOGS ***
CREATE TABLE STAR(
STAR_ID NUMBER
STAR_NAME VARCHAR2
DESCRIPTION VARCHAR2
BUSINESS_AREA_ID NUMBER
URL_OF_MODEL VARCHAR2)

 ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE STAR **

SQL: SELECT DISTINCT ST.STAR_NAME, REPLACE (REPLACE (ST.DESCRIPTION, CHR(13)), CHR(10), ' ') AS STAR_DESCRIPTION,  UV.VIEW_NAME, REPLACE (REPLACE (UV.DESCRIPTION, CHR(13)), CHR(10), ' ') AS VIEW_DESCRIPTION, F.FIELD_NAME, F.DEFINITION AS FIELD_DESCRIPTION  FROM STAR ST JOIN STAR_USER_VIEW SAV ON ST.STAR_ID = SAV.STAR_ID JOIN USER_VIEW UV ON SAV.VIEW_ID = UV.VIEW_ID JOIN FIELDS F ON F.TABLE_NAME = UV.VIEW_NAME ORDER BY 1, 3, 4;


CREATE TABLE FAC_BUILDING(
DATE_ACQUIRED VARCHAR2
DATE_OCCUPIED VARCHAR2
WAREHOUSE_LOAD_DATE DATE
NUM_OF_ROOMS NUMBER
FAC_BUILDING_KEY VARCHAR2
BUILDING_NUMBER VARCHAR2
PARENT_BUILDING_NUMBER VARCHAR2
PARENT_BUILDING_NAME VARCHAR2
PARENT_BUILDING_NAME_LONG VARCHAR2
BUILDING_NAME_LONG VARCHAR2
EXT_GROSS_AREA NUMBER
ASSIGNABLE_AREA NUMBER
NON_ASSIGNABLE_AREA NUMBER
SITE VARCHAR2
CAMPUS_SECTOR VARCHAR2
ACCESS_LEVEL_CODE NUMBER
ACCESS_LEVEL_NAME VARCHAR2
BUILDING_TYPE VARCHAR2
OWNERSHIP_TYPE VARCHAR2
BUILDING_USE VARCHAR2
OCCUPANCY_CLASS VARCHAR2
BUILDING_HEIGHT VARCHAR2
COST_CENTER_CODE VARCHAR2
COST_COLLECTOR_KEY VARCHAR2
LATITUDE_WGS NUMBER
LONGITUDE_WGS NUMBER
EASTING_X_SPCS NUMBER
NORTHING_Y_SPCS NUMBER
BUILDING_SORT VARCHAR2
BUILDING_NAMED_FOR VARCHAR2
BUILDING_NAME VARCHAR2
DATE_BUILT VARCHAR2)

 ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE FAC_BUILDING **

SQL: WITH BUILDING_COUNT AS ( SELECT EXTRACT(YEAR FROM TO_DATE(CY_FB.DATE_BUILT, 'MM/DD/YYYY')) AS YEAR_BUILT, COUNT(CY_FB.BUILDING_NUMBER) AS NUMBER_OF_BUILDINGS FROM WAREUSER.FAC_BUILDING CY_FB WHERE CY_FB.DATE_BUILT IS NOT NULL GROUP BY EXTRACT(YEAR FROM TO_DATE(CY_FB.DATE_BUILT, 'MM/DD/YYYY'))), PREVIOUS_YEAR_COUNTS AS ( SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , NVL(LAG(NUMBER_OF_BUILDINGS) OVER (ORDER BY YEAR_BUILT), 0) AS PREVIOUS_YEAR_COUNT , NUMBER_OF_BUILDINGS - NVL(LAG(NUMBER_OF_BUILDINGS) OVER (ORDER BY YEAR_BUILT), 0) AS YEAR_OVER_YEAR_COUNT FROM BUILDING_COUNT), MAX_YEAR_OVER_YEAR AS ( SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , PREVIOUS_YEAR_COUNT , YEAR_OVER_YEAR_COUNT , MAX(YEAR_OVER_YEAR_COUNT) OVER (PARTITION BY 1) AS MAX_YEAR_OVER_YEAR_COUNT FROM PREVIOUS_YEAR_COUNTS) SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , PREVIOUS_YEAR_COUNT , YEAR_OVER_YEAR_COUNT FROM MAX_YEAR_OVER_YEAR WHERE MAX_YEAR_OVER_YEAR_COUNT = YEAR_OVER_YEAR_COUNT;

SQL: SELECT HOU.HR_DEPARTMENT_NAME , FB.BUILDING_NUMBER , COUNT(FR.ROOM) OVER (PARTITION BY HOU.HR_DEPARTMENT_NAME, FB.BUILDING_NUMBER ) AS ROOMS_PER_DEPT_PER_BUILDING , FR.ROOM FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE WHERE HOU.HR_DEPARTMENT_NAME = 'School of Engineering';

SQL: SELECT DATE_BUILT FROM WAREUSER.FAC_BUILDING;

SQL: SELECT HOU.HR_DEPARTMENT_NAME , SUM(FR.AREA) TOTAL_AREA_PER_BUILDING FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE GROUP BY HOU.HR_DEPARTMENT_NAME;

SQL: SELECT HOU.HR_DEPARTMENT_NAME , FB.BUILDING_NUMBER , SUM(FR.AREA) TOTAL_AREA_PER_BUILDING FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE GROUP BY HOU.HR_DEPARTMENT_NAME, FB.BUILDING_NUMBER ORDER BY HOU.HR_DEPARTMENT_NAME;

SQL: SELECT FR.FAC_ROOM_KEY , FR.BUILDING_KEY , FR.FLOOR , FR.ROOM , FR.SPACE_ID , FR.MAJOR_USE_KEY , FR.USE_KEY , FR.USE_DESC , FR.ORGANIZATION_NAME , FR.AREA , FR.WAREHOUSE_LOAD_DATE FROM WAREUSER.FAC_ROOMS FR JOIN WAREUSER.FAC_BUILDING FB ON FR.BUILDING_KEY = FB.FAC_BUILDING_KEY AND FB.SITE = 'MIT' AND (FR.FAC_ROOM_KEY LIKE '%T' OR FR.USE_DESC = 'TELE');

SQL:  SELECT LATITUDE_WGS , LONGITUDE_WGS FROM WAREUSER.FAC_BUILDING;

SQL: SELECT HOU.HR_DEPARTMENT_NAME, FAC_BUILDING_KEY, FB.BUILDING_NUMBER, FR.FAC_ROOM_KEY, FR.ROOM, FR.AREA FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE WHERE HOU.HR_DEPARTMENT_NAME = 'School of Engineering';


CREATE TABLE EMPLOYEE_DIRECTORY(
MIT_ID VARCHAR2
LAST_NAME VARCHAR2
FIRST_NAME VARCHAR2
MIDDLE_NAME VARCHAR2
FULL_NAME VARCHAR2
DIRECTORY_FULL_NAME VARCHAR2
OFFICE_LOCATION VARCHAR2
OFFICE_PHONE VARCHAR2
DIRECTORY_TITLE VARCHAR2
PRIMARY_TITLE VARCHAR2
DEPARTMENT_NUMBER VARCHAR2
DEPARTMENT_NAME VARCHAR2
KRB_NAME VARCHAR2
KRB_NAME_UPPERCASE VARCHAR2
EMAIL_ADDRESS VARCHAR2
PERSONAL_URL VARCHAR2
NAME_KNOWN_BY VARCHAR2
EMAIL_ADDRESS_UPPERCASE VARCHAR2
FULL_NAME_UPPERCASE VARCHAR2
PREFERRED_FIRST_NAME_UPPER VARCHAR2
PREFERRED_LAST_NAME_UPPER VARCHAR2)

 ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE EMPLOYEE_DIRECTORY **

SQL: WITH SUBJECT AS ( SELECT TIP_SUBJECT_OFFERED.SUBJECT_ID SUBJECT_ID , TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL IS_NO_COURSE_MATERIAL , TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE OFFER_DEPT_CODE , TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME OFFER_DEPT_NAME , TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME OFFER_SCHOOL_NAME , ACADEMIC_TERMS.TERM_CODE TERM_CODE , ACADEMIC_TERMS.TERM_SELECTOR TERM_SELECTOR , CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END AS SUBMITTED , TIP_SUBJECT_OFFERED.SUBJECT_TITLE SUBJECT_TITLE , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID MASTER_SUBJECT_ID , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER MASTER_COURSE_NUMBER , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC MASTER_COURSE_NUMBER_DESC , TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME RESPONSIBLE_FACULTY_NAME , LOWER(KRB_PERSON.EMAIL_ADDRESS) c14 , SUM(TIP_SUBJECT_OFFERED.NUM_ENROLLED_STUDENTS) NUM_ENROLLED_STUDENTS , TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT MASTER_SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT COURSE_NUMBER_SORT , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT MASTER_COURSE_NUMBER_SORT , NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL) FALL_INSTRUCTORS , NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) SPRING_INSTRUCTORS , 'summary' AS SHOWSUMMARY , 'allcourses' AS SHOWALLCOURSES , 'SUBMITTED' AS SHOWSUBMITTED , 'notSUBMITTED' AS SHOWNOTSUBMITTED FROM WAREUSER.ACADEMIC_TERMS ACADEMIC_TERMS JOIN WAREUSER.TIP_SUBJECT_OFFERED TIP_SUBJECT_OFFERED ON ACADEMIC_TERMS.TERM_CODE = TIP_SUBJECT_OFFERED.TERM_CODE LEFT JOIN WAREUSER.TIP_DETAIL TIP_DETAIL ON TIP_SUBJECT_OFFERED.TIP_SUBJECT_OFFERED_KEY = TIP_DETAIL.TIP_SUBJECT_OFFERED_KEY LEFT JOIN WAREUSER.EMPLOYEE_DIRECTORY KRB_PERSON ON TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_MIT_ID = KRB_PERSON.MIT_ID LEFT JOIN WAREUSER.CIS_COURSE_CATALOG CIS_COURSE_CATALOG ON TIP_SUBJECT_OFFERED.SUBJECT_ID = CIS_COURSE_CATALOG.SUBJECT_ID AND SUBSTR(TIP_SUBJECT_OFFERED.TERM_CODE, 1, 4) = CIS_COURSE_CATALOG.ACADEMIC_YEAR WHERE TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME IN ( 'Science' ) AND ACADEMIC_TERMS.TERM_CODE IN ( '2024SU' ) AND CIS_COURSE_CATALOG.TUITION_ATTRIBUTE IS NULL AND CIS_COURSE_CATALOG.SUPERVISOR_ATTRIBUTE IS NULL AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.NIV%' AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.UR%' GROUP BY TIP_SUBJECT_OFFERED.SUBJECT_ID, TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL, TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE, TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME, TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME, ACADEMIC_TERMS.TERM_CODE, ACADEMIC_TERMS.TERM_SELECTOR, CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END, TIP_SUBJECT_OFFERED.SUBJECT_TITLE, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC, TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME, LOWER(KRB_PERSON.EMAIL_ADDRESS), TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT, NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL), NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) HAVING TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE IN ( '9' ) ) SELECT TERM_SELECTOR , COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBJECT_COUNT , OFFER_DEPT_CODE , OFFER_SCHOOL_NAME , TERM_CODE , SHOWALLCOURSES , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBMITTED , SHOWSUBMITTED , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_SUBMITTED , COUNT(DISTINCT SUBJECT_ID) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME , TERM_CODE) AS NOT_SUBMITTED , SHOWNOTSUBMITTED , 1 - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_NOT_SUBMITTED , OFFER_DEPT_NAME FROM SUBJECT;

SQL: SELECT * FROM WAREUSER.SPACE_SUPERVISOR_USAGE SSU JOIN EMPLOYEE_DIRECTORY ED ON ED.MIT_ID = SSU.MIT_ID;


CREATE TABLE SPACE_SUPERVISOR_USAGE(
MIT_ID VARCHAR2
DEPT_COUNT NUMBER
DEPT_NAMES VARCHAR2
NUM_OF_SUPERVISEES NUMBER
SQFT NUMBER
RESEARCH_VOLUME NUMBER
SQFT_PER_SUPERVISEE NUMBER
SQFT_PER_RES_VOL NUMBER
RES_VOL_PER_SQFT NUMBER)

 ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE SPACE_SUPERVISOR_USAGE **

SQL: SELECT * FROM WAREUSER.SPACE_SUPERVISOR_USAGE SSU JOIN EMPLOYEE_DIRECTORY ED ON ED.MIT_ID = SSU.MIT_ID;


CREATE TABLE ALL_VIEWS(
OWNER VARCHAR2
VIEW_NAME VARCHAR2
TEXT_LENGTH NUMBER
TEXT LONG
TYPE_TEXT_LENGTH NUMBER
TYPE_TEXT VARCHAR2
OID_TEXT_LENGTH NUMBER
OID_TEXT VARCHAR2
VIEW_TYPE_OWNER VARCHAR2
VIEW_TYPE VARCHAR2
SUPERVIEW_NAME VARCHAR2)

CREATE TABLE USER_VIEW(
VIEW_ID NUMBER
VIEW_NAME VARCHAR2
DESCRIPTION VARCHAR2
SENSITIVITY_ID NUMBER
STATUS VARCHAR2
VIEW_TYPE VARCHAR2
PRIMARY_PROVIDER_CODE VARCHAR2
ADDITIONAL_PROVIDER_INFO VARCHAR2)

 ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE USER_VIEW **

SQL: SELECT DISTINCT ST.STAR_NAME, REPLACE (REPLACE (ST.DESCRIPTION, CHR(13)), CHR(10), ' ') AS STAR_DESCRIPTION,  UV.VIEW_NAME, REPLACE (REPLACE (UV.DESCRIPTION, CHR(13)), CHR(10), ' ') AS VIEW_DESCRIPTION, F.FIELD_NAME, F.DEFINITION AS FIELD_DESCRIPTION  FROM STAR ST JOIN STAR_USER_VIEW SAV ON ST.STAR_ID = SAV.STAR_ID JOIN USER_VIEW UV ON SAV.VIEW_ID = UV.VIEW_ID JOIN FIELDS F ON F.TABLE_NAME = UV.VIEW_NAME ORDER BY 1, 3, 4;


CREATE TABLE TIP_DETAIL(
TIP_SUBJECT_OFFERED_KEY VARCHAR2
TIP_MATERIAL_KEY VARCHAR2
TIP_MATERIAL_STATUS_KEY VARCHAR2
TERM_CODE VARCHAR2
SUBJECT_ID VARCHAR2
ISBN VARCHAR2
RECORD_COUNT NUMBER
WAREHOUSE_LOAD_DATE DATE)

 ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE TIP_DETAIL **

SQL: WITH SUBJECT AS ( SELECT TIP_SUBJECT_OFFERED.SUBJECT_ID SUBJECT_ID , TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL IS_NO_COURSE_MATERIAL , TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE OFFER_DEPT_CODE , TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME OFFER_DEPT_NAME , TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME OFFER_SCHOOL_NAME , ACADEMIC_TERMS.TERM_CODE TERM_CODE , ACADEMIC_TERMS.TERM_SELECTOR TERM_SELECTOR , CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END AS SUBMITTED , TIP_SUBJECT_OFFERED.SUBJECT_TITLE SUBJECT_TITLE , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID MASTER_SUBJECT_ID , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER MASTER_COURSE_NUMBER , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC MASTER_COURSE_NUMBER_DESC , TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME RESPONSIBLE_FACULTY_NAME , LOWER(KRB_PERSON.EMAIL_ADDRESS) c14 , SUM(TIP_SUBJECT_OFFERED.NUM_ENROLLED_STUDENTS) NUM_ENROLLED_STUDENTS , TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT MASTER_SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT COURSE_NUMBER_SORT , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT MASTER_COURSE_NUMBER_SORT , NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL) FALL_INSTRUCTORS , NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) SPRING_INSTRUCTORS , 'summary' AS SHOWSUMMARY , 'allcourses' AS SHOWALLCOURSES , 'SUBMITTED' AS SHOWSUBMITTED , 'notSUBMITTED' AS SHOWNOTSUBMITTED FROM WAREUSER.ACADEMIC_TERMS ACADEMIC_TERMS JOIN WAREUSER.TIP_SUBJECT_OFFERED TIP_SUBJECT_OFFERED ON ACADEMIC_TERMS.TERM_CODE = TIP_SUBJECT_OFFERED.TERM_CODE LEFT JOIN WAREUSER.TIP_DETAIL TIP_DETAIL ON TIP_SUBJECT_OFFERED.TIP_SUBJECT_OFFERED_KEY = TIP_DETAIL.TIP_SUBJECT_OFFERED_KEY LEFT JOIN WAREUSER.EMPLOYEE_DIRECTORY KRB_PERSON ON TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_MIT_ID = KRB_PERSON.MIT_ID LEFT JOIN WAREUSER.CIS_COURSE_CATALOG CIS_COURSE_CATALOG ON TIP_SUBJECT_OFFERED.SUBJECT_ID = CIS_COURSE_CATALOG.SUBJECT_ID AND SUBSTR(TIP_SUBJECT_OFFERED.TERM_CODE, 1, 4) = CIS_COURSE_CATALOG.ACADEMIC_YEAR WHERE TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME IN ( 'Science' ) AND ACADEMIC_TERMS.TERM_CODE IN ( '2024SU' ) AND CIS_COURSE_CATALOG.TUITION_ATTRIBUTE IS NULL AND CIS_COURSE_CATALOG.SUPERVISOR_ATTRIBUTE IS NULL AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.NIV%' AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.UR%' GROUP BY TIP_SUBJECT_OFFERED.SUBJECT_ID, TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL, TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE, TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME, TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME, ACADEMIC_TERMS.TERM_CODE, ACADEMIC_TERMS.TERM_SELECTOR, CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END, TIP_SUBJECT_OFFERED.SUBJECT_TITLE, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC, TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME, LOWER(KRB_PERSON.EMAIL_ADDRESS), TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT, NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL), NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) HAVING TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE IN ( '9' ) ) SELECT TERM_SELECTOR , COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBJECT_COUNT , OFFER_DEPT_CODE , OFFER_SCHOOL_NAME , TERM_CODE , SHOWALLCOURSES , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBMITTED , SHOWSUBMITTED , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_SUBMITTED , COUNT(DISTINCT SUBJECT_ID) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME , TERM_CODE) AS NOT_SUBMITTED , SHOWNOTSUBMITTED , 1 - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_NOT_SUBMITTED , OFFER_DEPT_NAME FROM SUBJECT;


CREATE TABLE CIS_COURSE_CATALOG(
IS_OFFERED_FALL_TERM VARCHAR2
IS_OFFERED_IAP VARCHAR2
IS_OFFERED_SPRING_TERM VARCHAR2
IS_OFFERED_SUMMER_TERM VARCHAR2
FALL_INSTRUCTORS VARCHAR2
SPRING_INSTRUCTORS VARCHAR2
STATUS_CHANGE VARCHAR2
LAST_ACTIVITY_DATE DATE
WAREHOUSE_LOAD_DATE DATE
MASTER_SUBJECT_ID VARCHAR2
HASS_ATTRIBUTE VARCHAR2
HASS_ATTRIBUTE_DESC VARCHAR2
TERM_DURATION VARCHAR2
GLOBAL_REGIONS VARCHAR2
GLOBAL_COUNTRIES VARCHAR2
ON_LINE_PAGE_NUMBER VARCHAR2
ACADEMIC_YEAR VARCHAR2
SUBJECT_ID VARCHAR2
SUBJECT_CODE VARCHAR2
SUBJECT_NUMBER VARCHAR2
SOURCE_SUBJECT_ID VARCHAR2
PRINT_SUBJECT_ID VARCHAR2
IS_PRINTED_IN_BULLETIN VARCHAR2
DEPARTMENT_CODE VARCHAR2
DEPARTMENT_NAME VARCHAR2
EFFECTIVE_TERM_CODE VARCHAR2
SUBJECT_SHORT_TITLE VARCHAR2
SUBJECT_TITLE VARCHAR2
IS_VARIABLE_UNITS VARCHAR2
LECTURE_UNITS NUMBER
LAB_UNITS NUMBER
PREPARATION_UNITS NUMBER
TOTAL_UNITS NUMBER
DESIGN_UNITS NUMBER
GRADE_TYPE VARCHAR2
GRADE_TYPE_DESC VARCHAR2
GRADE_RULE VARCHAR2
GRADE_RULE_DESC VARCHAR2
HGN_CODE VARCHAR2
HGN_DESC VARCHAR2
HGN_EXCEPT VARCHAR2
GIR_ATTRIBUTE VARCHAR2
GIR_ATTRIBUTE_DESC VARCHAR2
COMM_REQ_ATTRIBUTE VARCHAR2
COMM_REQ_ATTRIBUTE_DESC VARCHAR2
TUITION_ATTRIBUTE VARCHAR2
TUITION_ATTRIBUTE_DESC VARCHAR2
WRITE_REQ_ATTRIBUTE VARCHAR2
WRITE_REQ_ATTRIBUTE_DESC VARCHAR2
SUPERVISOR_ATTRIBUTE VARCHAR2
SUPERVISOR_ATTRIBUTE_DESC VARCHAR2
PREREQUISITES VARCHAR2
SUBJECT_DESCRIPTION VARCHAR2
JOINT_SUBJECTS VARCHAR2
SCHOOL_WIDE_ELECTIVES VARCHAR2
MEETS_WITH_SUBJECTS VARCHAR2
EQUIVALENT_SUBJECTS VARCHAR2
IS_OFFERED_THIS_YEAR VARCHAR2)

 ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE CIS_COURSE_CATALOG **


BadRequestError: Error code: 400 - {'error': {'message': "This model's maximum context length is 8192 tokens. However, your messages resulted in 11524 tokens. Please reduce the length of the messages.", 'type': 'invalid_request_error', 'param': 'messages', 'code': 'context_length_exceeded'}}

# READ DATAFRAME

In [5]:
df_q = pd.read_csv(str(prefix) + '/data/gpt_eval_Brandin_v0.1.csv')

In [9]:
new_row = {'question':"What kind of questions can I ask the data warehoues?", 'sql':["SELECT DISTINCT ST.STAR_NAME, REPLACE (REPLACE (ST.DESCRIPTION, CHR(13)), CHR(10), ' ') AS STAR_DESCRIPTION,  UV.VIEW_NAME, REPLACE (REPLACE (UV.DESCRIPTION, CHR(13)), CHR(10), ' ') AS VIEW_DESCRIPTION, F.FIELD_NAME, F.DEFINITION AS FIELD_DESCRIPTION  FROM STAR ST JOIN STAR_USER_VIEW SAV ON ST.STAR_ID = SAV.STAR_ID JOIN USER_VIEW UV ON SAV.VIEW_ID = UV.VIEW_ID JOIN FIELDS F ON F.TABLE_NAME = UV.VIEW_NAME ORDER BY 1, 3, 4;"],
       'tables':[], 'gpt_sql_nocontext':[],
       'gpt_sql_global_schema':[], 'expected_responses':[],
       'responses_gpt_nocontent':[], 'failures_gpt_nocontent':[],
       'accuracies_nocontext':[], 'precisions_nocontext':[], 'recalls_nocontext':[],
       'f1_scores_nocontext':[], 'responses_gpt_global_schema':[],
       'failures_gpt_global_schema':[], 'accuracies_global_schema':[],
       'precisions_global_schema':[], 'recalls_global_schema':[],
       'f1_scores_global_schema':[]}
new_df = pd.DataFrame([new_row])
df_q = pd.concat([df_q, new_df], ignore_index=True)

In [8]:

df_q['sql'][10]

["WITH SUBJECT AS ( SELECT TIP_SUBJECT_OFFERED.SUBJECT_ID SUBJECT_ID , TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL IS_NO_COURSE_MATERIAL , TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE OFFER_DEPT_CODE , TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME OFFER_DEPT_NAME , TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME OFFER_SCHOOL_NAME , ACADEMIC_TERMS.TERM_CODE TERM_CODE , ACADEMIC_TERMS.TERM_SELECTOR TERM_SELECTOR , CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END AS SUBMITTED , TIP_SUBJECT_OFFERED.SUBJECT_TITLE SUBJECT_TITLE , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID MASTER_SUBJECT_ID , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER MASTER_COURSE_NUMBER , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC MASTER_COURSE_NUMBER_DESC , TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME RESPONSIBLE_FACULTY_NAME , LOWER(KRB_PERSON.EMAIL_ADDRESS) c14 , SUM(TIP_SUBJECT_OFFERED.NUM_ENROLLED_STUDENTS) NUM_ENROLLED_STUDENTS , TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT MASTER_SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT COURSE_NUMBER_SORT , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT MASTER_COURSE_NUMBER_SORT , NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL) FALL_INSTRUCTORS , NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) SPRING_INSTRUCTORS , 'summary' AS SHOWSUMMARY , 'allcourses' AS SHOWALLCOURSES , 'SUBMITTED' AS SHOWSUBMITTED , 'notSUBMITTED' AS SHOWNOTSUBMITTED FROM WAREUSER.ACADEMIC_TERMS ACADEMIC_TERMS JOIN WAREUSER.TIP_SUBJECT_OFFERED TIP_SUBJECT_OFFERED ON ACADEMIC_TERMS.TERM_CODE = TIP_SUBJECT_OFFERED.TERM_CODE LEFT JOIN WAREUSER.TIP_DETAIL TIP_DETAIL ON TIP_SUBJECT_OFFERED.TIP_SUBJECT_OFFERED_KEY = TIP_DETAIL.TIP_SUBJECT_OFFERED_KEY LEFT JOIN WAREUSER.EMPLOYEE_DIRECTORY KRB_PERSON ON TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_MIT_ID = KRB_PERSON.MIT_ID LEFT JOIN WAREUSER.CIS_COURSE_CATALOG CIS_COURSE_CATALOG ON TIP_SUBJECT_OFFERED.SUBJECT_ID = CIS_COURSE_CATALOG.SUBJECT_ID AND SUBSTR(TIP_SUBJECT_OFFERED.TERM_CODE, 1, 4) = CIS_COURSE_CATALOG.ACADEMIC_YEAR WHERE TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME IN ( 'Science' ) AND ACADEMIC_TERMS.TERM_CODE IN ( '2024SU' ) AND CIS_COURSE_CATALOG.TUITION_ATTRIBUTE IS NULL AND CIS_COURSE_CATALOG.SUPERVISOR_ATTRIBUTE IS NULL AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.NIV%' AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.UR%' GROUP BY TIP_SUBJECT_OFFERED.SUBJECT_ID, TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL, TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE, TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME, TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME, ACADEMIC_TERMS.TERM_CODE, ACADEMIC_TERMS.TERM_SELECTOR, CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END, TIP_SUBJECT_OFFERED.SUBJECT_TITLE, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC, TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME, LOWER(KRB_PERSON.EMAIL_ADDRESS), TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT, NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL), NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) HAVING TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE IN ( '9' ) ) SELECT TERM_SELECTOR , COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBJECT_COUNT , OFFER_DEPT_CODE , OFFER_SCHOOL_NAME , TERM_CODE , SHOWALLCOURSES , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBMITTED , SHOWSUBMITTED , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_SUBMITTED , COUNT(DISTINCT SUBJECT_ID) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME , TERM_CODE) AS NOT_SUBMITTED , SHOWNOTSUBMITTED , 1 - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_NOT_SUBMITTED , OFFER_DEPT_NAME FROM SUBJECT;"]

In [5]:
df_q.keys()

Index(['question', 'sql', 'tables', 'gpt_sql_nocontext',
       'gpt_sql_global_schema', 'expected_responses',
       'responses_gpt_nocontent', 'failures_gpt_nocontent',
       'accuracies_nocontext', 'precisions_nocontext', 'recalls_nocontext',
       'f1_scores_nocontext', 'responses_gpt_global_schema',
       'failures_gpt_global_schema', 'accuracies_global_schema',
       'precisions_global_schema', 'recalls_global_schema',
       'f1_scores_global_schema'],
      dtype='object')

In [17]:
for q in df_q['gpt_sql_global_schema']:
    print(q[0])

SELECT * FROM HR_ORG_UNIT
SELECT SUM(AREA) FROM FAC_ROOMS WHERE DEPT_CODE IN (SELECT HR_DEPARTMENT_CODE FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_NAME LIKE '%Engineering%')
SELECT DEPT_CODE, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS GROUP BY DEPT_CODE
SELECT DEPT_CODE, BUILDING_KEY, SUM(AREA) AS TOTAL_AREA FROM FAC_ROOMS GROUP BY DEPT_CODE, BUILDING_KEY
SELECT FAC_BUILDING.BUILDING_NUMBER, COUNT(FAC_ROOMS.ROOM), SUM(FAC_ROOMS.AREA) FROM FAC_BUILDING JOIN FAC_ROOMS ON FAC_BUILDING.BUILDING_KEY = FAC_ROOMS.BUILDING_KEY WHERE FAC_ROOMS.DEPT_CODE = 'department_code' GROUP BY FAC_BUILDING.BUILDING_NUMBER
SELECT ROOM, MAJOR_USE_DESC FROM FAC_ROOMS
SELECT ROOM, LATITUDE_WGS, LONGITUDE_WGS FROM FAC_ROOMS
SELECT BUILDING_NAME, DATE_BUILT, (YEAR(CURRENT_DATE) - YEAR(DATE_BUILT)) AS BUILDING_AGE FROM FAC_BUILDING
SELECT SUM(SQFT) FROM SPACE_SUPERVISOR_USAGE
SELECT YEAR FROM (SELECT DATE_BUILT AS YEAR, COUNT(FAC_BUILDING_KEY) AS NUM_BUILDINGS, COUNT(FAC_BUILDING_KEY) - LAG(COUNT(FAC_BUILDING_KEY), 1) OVER (ORDER BY DATE_BUILT) AS YOY_INCREASE FROM FAC_BUILDING GROUP BY DATE_BUILT ORDER BY YOY_INCREASE DESC) WHERE ROWNUM = 1
SELECT (COUNT(DISTINCT TIP_SUBJECT_OFFERED.SUBJECT_ID) / (SELECT COUNT(DISTINCT CIS_COURSE_CATALOG.SUBJECT_ID) FROM CIS_COURSE_CATALOG WHERE CIS_COURSE_CATALOG.EFFECTIVE_TERM_CODE = 'given_term_code')) * 100 AS PERCENTAGE FROM TIP_SUBJECT_OFFERED WHERE TIP_SUBJECT_OFFERED.TERM_CODE = 'given_term_code'

In [6]:
sql = []
tables = []
gpt_sql_nocontext = []
gpt_sql_global_schema = []
expected_responses = []
for i in range(len(df_q)):
    sql.append(ast.literal_eval(df_q['sql'][i]))
    tables.append(ast.literal_eval(df_q['tables'][i]))
    gpt_sql_nocontext.append(ast.literal_eval(df_q['gpt_sql_nocontext'][i]))
    gpt_sql_global_schema.append(ast.literal_eval(df_q['gpt_sql_global_schema'][i]))
    #expected_responses.append(ast.literal_eval(df_q['expected_responses'][i]))
    #responses_gpt_nocontent.append(ast.literal_eval(df_q['responses_gpt_nocontent'][i]))
    #responses_gpt_global_schema.append(ast.literal_eval(df_q['responses_gpt_global_schema'][i]))
    #tables_referred_by_gpt_sql_global_schema.append(ast.literal_eval(df_q['tables_referred_by_gpt_sql_global_schema'][i]))
    #tables_referred_by_gpt_sql_nocontext.append(ast.literal_eval(df_q['tables_referred_by_gpt_sql_nocontext'][i]))
    #sql_outputsizes.append(ast.literal_eval(df_q['sql_outputsizes'][i]))
df_q['sql'] = sql
df_q['tables'] = tables
df_q['gpt_sql_global_schema'] = gpt_sql_global_schema
df_q['gpt_sql_nocontext'] = gpt_sql_nocontext
#df_q['sql_outputsizes'] = sql_outputsizes

In [ ]:
sql = []
tables = []
gpt_sql_global_schema = []
gpt_sql_nocontext = []
question = []
gpt_global_schema = []
for i in range(len(df_q)):
    if i == 0 or df_q['question'][i] != df_q['question'][i-1]:
        if gpt_global_schema != None and i != 0:
            gpt_sql_global_schema.append(gpt_global_schema)
        gpt_global_schema = []
        sql.append(df_q['sql'][i])
        tables.append(df_q['tables'][i])
        gpt_global_schema.append(df_q['gpt_sql_global_schema'][i])
        gpt_sql_nocontext.append(df_q['gpt_sql_nocontext'][i])
        question.append(df_q['question'][i])
    else:
        gpt_global_schema.append(df_q['gpt_sql_global_schema'][i])
gpt_sql_global_schema.append(gpt_global_schema)
df_temp = pd.DataFrame(data={"question":question, "sql":sql, "tables":tables, "gpt_sql_global_schema":gpt_sql_global_schema, "gpt_sql_nocontext":gpt_sql_nocontext})

In [ ]:
#pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.max_colwidth', None)
df_q

# Generated for all answers the actual output

## Start with the correct answers

In [7]:
gold_answers = []
failures = []
for qs in df_q['sql']:
    gold_answer = []
    failure = []
    print(qs)
    for q in qs:
        try:
            gold_answer.append(execute_query(q[:-1], [v.upper() for v in Parser(q).tables]))
            failure.append(None)
        except Exception as e:
            gold_answer.append(None)
            failure.append(str(e))
    print(failure)
    gold_answers.append(gold_answer)
    failures.append(failure)

["SELECT * FROM ALL_VIEWS WHERE OWNER = 'WAREUSER';"]
[None]
["SELECT HOU.HR_DEPARTMENT_NAME, FAC_BUILDING_KEY, FB.BUILDING_NUMBER, FR.FAC_ROOM_KEY, FR.ROOM, FR.AREA FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE WHERE HOU.HR_DEPARTMENT_NAME = 'School of Engineering';"]
[None]
['SELECT HOU.HR_DEPARTMENT_NAME , SUM(FR.AREA) TOTAL_AREA_PER_BUILDING FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE GROUP BY HOU.HR_DEPARTMENT_NAME;']
[None]
['SELECT HOU.HR_DEPARTMENT_NAME , FB.BUILDING_NUMBER , SUM(FR.AREA) TOTAL_AREA_PER_BUILDING FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE GROUP BY HOU.HR_DEPARTMENT_NAME, FB.BUILDING_NUMBER ORDER BY HOU.HR_DEPARTMENT_NAME;']
[None]
["SELECT HOU.HR_DEPARTMENT_NAME , FB.BUILDING_NUMBER , COUNT(FR.ROOM) OVER (PARTITION BY HOU.HR_DEPARTMENT_NAME, FB.BUILDING_NUMBER ) AS ROOMS_PER_DEPT_PER_BUILDING , FR.ROOM FROM WAREUSER.FAC_BUILDING FB JOIN WAREUSER.FAC_ROOMS FR ON FB.FAC_BUILDING_KEY = FR.BUILDING_KEY JOIN WAREUSER.FAC_ORGANIZATION FO ON FO.ORGANIZATION_KEY = FR.ORGANIZATION_KEY JOIN HR_ORG_UNIT HOU ON HOU.DLC_KEY = FO.D_CODE WHERE HOU.HR_DEPARTMENT_NAME = 'School of Engineering';"]
[None]
["SELECT FR.FAC_ROOM_KEY , FR.BUILDING_KEY , FR.FLOOR , FR.ROOM , FR.SPACE_ID , FR.MAJOR_USE_KEY , FR.USE_KEY , FR.USE_DESC , FR.ORGANIZATION_NAME , FR.AREA , FR.WAREHOUSE_LOAD_DATE FROM WAREUSER.FAC_ROOMS FR JOIN WAREUSER.FAC_BUILDING FB ON FR.BUILDING_KEY = FB.FAC_BUILDING_KEY AND FB.SITE = 'MIT' AND (FR.FAC_ROOM_KEY LIKE '%T' OR FR.USE_DESC = 'TELE');"]
[None]
[' SELECT LATITUDE_WGS , LONGITUDE_WGS FROM WAREUSER.FAC_BUILDING;']
[None]
['SELECT DATE_BUILT FROM WAREUSER.FAC_BUILDING;']
[None]
['SELECT * FROM WAREUSER.SPACE_SUPERVISOR_USAGE SSU JOIN EMPLOYEE_DIRECTORY ED ON ED.MIT_ID = SSU.MIT_ID;']
[None]
["WITH BUILDING_COUNT AS ( SELECT EXTRACT(YEAR FROM TO_DATE(CY_FB.DATE_BUILT, 'MM/DD/YYYY')) AS YEAR_BUILT, COUNT(CY_FB.BUILDING_NUMBER) AS NUMBER_OF_BUILDINGS FROM WAREUSER.FAC_BUILDING CY_FB WHERE CY_FB.DATE_BUILT IS NOT NULL GROUP BY EXTRACT(YEAR FROM TO_DATE(CY_FB.DATE_BUILT, 'MM/DD/YYYY'))), PREVIOUS_YEAR_COUNTS AS ( SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , NVL(LAG(NUMBER_OF_BUILDINGS) OVER (ORDER BY YEAR_BUILT), 0) AS PREVIOUS_YEAR_COUNT , NUMBER_OF_BUILDINGS - NVL(LAG(NUMBER_OF_BUILDINGS) OVER (ORDER BY YEAR_BUILT), 0) AS YEAR_OVER_YEAR_COUNT FROM BUILDING_COUNT), MAX_YEAR_OVER_YEAR AS ( SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , PREVIOUS_YEAR_COUNT , YEAR_OVER_YEAR_COUNT , MAX(YEAR_OVER_YEAR_COUNT) OVER (PARTITION BY 1) AS MAX_YEAR_OVER_YEAR_COUNT FROM PREVIOUS_YEAR_COUNTS) SELECT YEAR_BUILT , NUMBER_OF_BUILDINGS , PREVIOUS_YEAR_COUNT , YEAR_OVER_YEAR_COUNT FROM MAX_YEAR_OVER_YEAR WHERE MAX_YEAR_OVER_YEAR_COUNT = YEAR_OVER_YEAR_COUNT;"]
[None]
["WITH SUBJECT AS ( SELECT TIP_SUBJECT_OFFERED.SUBJECT_ID SUBJECT_ID , TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL IS_NO_COURSE_MATERIAL , TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE OFFER_DEPT_CODE , TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME OFFER_DEPT_NAME , TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME OFFER_SCHOOL_NAME , ACADEMIC_TERMS.TERM_CODE TERM_CODE , ACADEMIC_TERMS.TERM_SELECTOR TERM_SELECTOR , CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END AS SUBMITTED , TIP_SUBJECT_OFFERED.SUBJECT_TITLE SUBJECT_TITLE , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID MASTER_SUBJECT_ID , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER MASTER_COURSE_NUMBER , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC MASTER_COURSE_NUMBER_DESC , TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME RESPONSIBLE_FACULTY_NAME , LOWER(KRB_PERSON.EMAIL_ADDRESS) c14 , SUM(TIP_SUBJECT_OFFERED.NUM_ENROLLED_STUDENTS) NUM_ENROLLED_STUDENTS , TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT MASTER_SUBJECT_ID_SORT , TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT COURSE_NUMBER_SORT , TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT MASTER_COURSE_NUMBER_SORT , NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL) FALL_INSTRUCTORS , NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) SPRING_INSTRUCTORS , 'summary' AS SHOWSUMMARY , 'allcourses' AS SHOWALLCOURSES , 'SUBMITTED' AS SHOWSUBMITTED , 'notSUBMITTED' AS SHOWNOTSUBMITTED FROM WAREUSER.ACADEMIC_TERMS ACADEMIC_TERMS JOIN WAREUSER.TIP_SUBJECT_OFFERED TIP_SUBJECT_OFFERED ON ACADEMIC_TERMS.TERM_CODE = TIP_SUBJECT_OFFERED.TERM_CODE LEFT JOIN WAREUSER.TIP_DETAIL TIP_DETAIL ON TIP_SUBJECT_OFFERED.TIP_SUBJECT_OFFERED_KEY = TIP_DETAIL.TIP_SUBJECT_OFFERED_KEY LEFT JOIN WAREUSER.EMPLOYEE_DIRECTORY KRB_PERSON ON TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_MIT_ID = KRB_PERSON.MIT_ID LEFT JOIN WAREUSER.CIS_COURSE_CATALOG CIS_COURSE_CATALOG ON TIP_SUBJECT_OFFERED.SUBJECT_ID = CIS_COURSE_CATALOG.SUBJECT_ID AND SUBSTR(TIP_SUBJECT_OFFERED.TERM_CODE, 1, 4) = CIS_COURSE_CATALOG.ACADEMIC_YEAR WHERE TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME IN ( 'Science' ) AND ACADEMIC_TERMS.TERM_CODE IN ( '2024SU' ) AND CIS_COURSE_CATALOG.TUITION_ATTRIBUTE IS NULL AND CIS_COURSE_CATALOG.SUPERVISOR_ATTRIBUTE IS NULL AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.NIV%' AND TIP_SUBJECT_OFFERED.SUBJECT_ID NOT LIKE '%.UR%' GROUP BY TIP_SUBJECT_OFFERED.SUBJECT_ID, TIP_SUBJECT_OFFERED.IS_NO_COURSE_MATERIAL, TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE, TIP_SUBJECT_OFFERED.OFFER_DEPT_NAME, TIP_SUBJECT_OFFERED.OFFER_SCHOOL_NAME, ACADEMIC_TERMS.TERM_CODE, ACADEMIC_TERMS.TERM_SELECTOR, CASE WHEN TIP_DETAIL.SUBJECT_ID IS NULL THEN 0 ELSE 1 END, TIP_SUBJECT_OFFERED.SUBJECT_TITLE, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_DESC, TIP_SUBJECT_OFFERED.RESPONSIBLE_FACULTY_NAME, LOWER(KRB_PERSON.EMAIL_ADDRESS), TIP_SUBJECT_OFFERED.SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.MASTER_SUBJECT_ID_SORT, TIP_SUBJECT_OFFERED.COURSE_NUMBER_SORT, TIP_SUBJECT_OFFERED.MASTER_COURSE_NUMBER_SORT, NVL(CIS_COURSE_CATALOG.FALL_INSTRUCTORS, NULL), NVL(CIS_COURSE_CATALOG.SPRING_INSTRUCTORS, NULL) HAVING TIP_SUBJECT_OFFERED.OFFER_DEPT_CODE IN ( '9' ) ) SELECT TERM_SELECTOR , COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBJECT_COUNT , OFFER_DEPT_CODE , OFFER_SCHOOL_NAME , TERM_CODE , SHOWALLCOURSES , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) AS SUBMITTED , SHOWSUBMITTED , SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_SUBMITTED , COUNT(DISTINCT SUBJECT_ID) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME , TERM_CODE) AS NOT_SUBMITTED , SHOWNOTSUBMITTED , 1 - SUM(SUBMITTED) OVER(PARTITION BY OFFER_DEPT_NAME, TERM_CODE) / NULLIF(COUNT(DISTINCT SUBJECT_ID) OVER (PARTITION BY OFFER_DEPT_NAME, TERM_CODE),0) AS PERCENT_NOT_SUBMITTED , OFFER_DEPT_NAME FROM SUBJECT;"]
[None]
["SELECT DISTINCT ST.STAR_NAME, REPLACE (REPLACE (ST.DESCRIPTION, CHR(13)), CHR(10), ' ') AS STAR_DESCRIPTION,  UV.VIEW_NAME, REPLACE (REPLACE (UV.DESCRIPTION, CHR(13)), CHR(10), ' ') AS VIEW_DESCRIPTION, F.FIELD_NAME, F.DEFINITION AS FIELD_DESCRIPTION  FROM STAR ST JOIN STAR_USER_VIEW SAV ON ST.STAR_ID = SAV.STAR_ID JOIN USER_VIEW UV ON SAV.VIEW_ID = UV.VIEW_ID JOIN FIELDS F ON F.TABLE_NAME = UV.VIEW_NAME ORDER BY 1, 3, 4;"]
[None]

In [11]:
df_q['expected_responses'] = gold_answers
if not all([None in f for f in failures]):
    print("Please check errors!")

## Continue with the answers from gpt with no additional information

In [12]:
gold_answers = []
failures = []
for qs in df_q['gpt_sql_nocontext']:
    gold_answer = []
    failure = []
    for q in qs:
        try:
            gold_answer.append(execute_query(q, [v.upper() for v in Parser(q).tables]))
            failure.append(None)
        except Exception as e:
            gold_answer.append(None)
            failure.append(str(e))
    gold_answers.append(gold_answer)
    failures.append(failure)

Not supported query type: This question cannot be answered with a SQL query as it requires administrative access to the MIT Data Warehouse system. The access to the warehouse is determined by the user's role and permissions, which are managed by the system administrators.

SELECT SUM(space_square_feet) FROM mit_space_data WHERE department = 'Engineering'
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT SUM(area) FROM mit_building_data WHERE department = 'Engineering'
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
SELECT department_id, SUM(space) AS total_space FROM department_space GROUP BY department_id
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT d.department_name, SUM(s.space) AS total_space FROM department_space s JOIN departments d ON s.department_id = d.department_id GROUP BY d.department_name
 SELECT d.department_name, SUM(s.space) AS total_space FROM department_space s JOIN departments d ON s.department_id = d.department_id GROUP BY d.department_name
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
SELECT Department, Building, SUM(Space) AS TotalSpace FROM DepartmentSpaceTable GROUP BY Department, Building
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Departments d JOIN Spaces s ON d.DepartmentID = s.DepartmentID JOIN Buildings b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName
 SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Departments d JOIN Spaces s ON d.DepartmentID = s.DepartmentID JOIN Buildings b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName
 SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Departments d JOIN Spaces s ON d.DepartmentID = s.DepartmentID JOIN Buildings b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT Department, Building, SUM(Space) AS TotalSpace FROM Department_Building_Space GROUP BY Department, Building
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Department d INNER JOIN Space s ON d.DepartmentID = s.DepartmentID INNER JOIN Building b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName
 SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Department d INNER JOIN Space s ON d.DepartmentID = s.DepartmentID INNER JOIN Building b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName
 SELECT d.DepartmentName, b.BuildingName, SUM(s.Space) AS TotalSpace FROM Department d INNER JOIN Space s ON d.DepartmentID = s.DepartmentID INNER JOIN Building b ON s.BuildingID = b.BuildingID GROUP BY d.DepartmentName, b.BuildingName
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
SELECT BUILDING_ID, COUNT(ROOM_ID) AS ROOM_COUNT FROM WAREUSER.ROOMS WHERE DEPARTMENT_ID = 'your_department_id' GROUP BY BUILDING_ID
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT BUILDING_ID, COUNT(ROOM_ID) AS TOTAL_ROOM_COUNT FROM WAREUSER.ROOMS GROUP BY BUILDING_ID
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
SELECT room_number, room_use FROM room_usage
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT room_id, usage_description FROM room_details
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT room_name, purpose FROM room_information
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
SELECT room_number, geo_tag FROM room_table
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT room_id, geo_location FROM room_info
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT room, geotag FROM building_rooms
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
SELECT CURRENT_DATE - construction_date AS building_age FROM buildings WHERE building_name = 'Building Name'
An error occurred: ORA-00904: "CONSTRUCTION_DATE": invalid identifier
An error occurred: ORA-00904: "CONSTRUCTION_DATE": invalid identifier
 SELECT YEAR(CURRENT_DATE) - YEAR(construction_date) AS building_age FROM buildings WHERE building_name = 'Building Name'
An error occurred: ORA-00904: "YEAR": invalid identifier
An error occurred: ORA-00904: "YEAR": invalid identifier
 SELECT DATEDIFF(YEAR, construction_date, CURRENT_DATE) AS building_age FROM buildings WHERE building_name = 'Building Name'
An error occurred: ORA-00904: "DATEDIFF": invalid identifier
An error occurred: ORA-00904: "DATEDIFF": invalid identifier
SELECT SUM(square_footage) FROM building
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
SELECT YEAR, MAX(YEAR_OVER_YEAR_INCREASE) FROM (SELECT YEAR, (BUILDING_COUNT - LAG(BUILDING_COUNT) OVER (ORDER BY YEAR)) AS YEAR_OVER_YEAR_INCREASE FROM (SELECT DATE_PART('year', WAREUSER.BUILDING_DATE) AS YEAR, COUNT(*) AS WAREUSER.BUILDING_COUNT FROM WAREUSER.BUILDING GROUP BY DATE_PART('year', WAREUSER.BUILDING_DATE))) AS SUBQUERY
An error occurred: ORA-00933: SQL command not properly ended
An error occurred: ORA-00923: FROM keyword not found where expected
SELECT * FROM (SELECT YEAR FROM (SELECT YEAR, (BUILDING_COUNT - LAG(BUILDING_COUNT) OVER (ORDER BY YEAR)) AS YEAR_OVER_YEAR_INCREASE FROM (SELECT EXTRACT(YEAR FROM WAREUSER.BUILDING_DATE) AS YEAR, COUNT(*) AS WAREUSER.BUILDING_COUNT FROM WAREUSER.BUILDING GROUP BY EXTRACT(YEAR FROM WAREUSER.BUILDING_DATE))) ORDER BY YEAR_OVER_YEAR_INCREASE DESC ) WHERE ROWNUM <=1
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00923: FROM keyword not found where expected

Not supported query type: As an AI, I can't answer this question. However, you can ask a variety of questions related to the data stored in the MIT Data Warehouse. For example, you can ask about student demographics, course enrollments, faculty details, financial data, research statistics, etc. The specific questions you can ask depend on the tables and fields available in the data warehouse.

SELECT (COUNT(DISTINCT course_id)* 100.0 / (SELECT COUNT(*) FROM courses)) AS percentage FROM tip_data WHERE term_code = 'given_term_code'
SELECT (COUNT(DISTINCT course_id)* 100.0 / (SELECT COUNT(*) FROM courses)) AS percentage FROM tip_data WHERE term_code = 'given_term_code'
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist
 SELECT (COUNT(DISTINCT t.course_id)* 100.0 / (SELECT COUNT(*) FROM courses c)) AS percentage FROM tip_data t INNER JOIN courses c ON t.course_id = c.course_id WHERE t.term_code = 'given_term_code'
 SELECT (COUNT(DISTINCT t.course_id)* 100.0 / (SELECT COUNT(*) FROM courses c)) AS percentage FROM tip_data t INNER JOIN courses c ON t.course_id = c.course_id WHERE t.term_code = 'given_term_code'
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00942: table or view does not exist

In [13]:
df_q['responses_gpt_nocontent'] = gold_answers
df_q['failures_gpt_nocontent'] = failures

## Continue with the answers from gpt with schema information

In [14]:
gold_answers = []
failures = []
for qs in df_q['gpt_sql_global_schema']:
    gold_answer = []
    failure = []
    for q in qs:
        try:
            gold_answer.append(execute_query(q, [v.upper() for v in Parser(q).tables]))
            failure.append(None)
        except Exception as e:
            gold_answer.append(None)
            failure.append(str(e))
    print(failure)
    gold_answers.append(gold_answer)
    failures.append(failure)

 SELECT * FROM WAREUSER.SPACE_SUPERVISOR_USAGE
[None, None, None, None, None, None, None, 'ORA-12170: TNS:Connect timeout occurred', None, None]
[None, None]
 SELECT ORGANIZATION_NAME, SUM(AREA) AS TOTAL_AREA FROM WAREUSER.FAC_ROOMS FR JOIN FAC_ORGANIZATION FO ON FR.ORGANIZATION_KEY = FO.ORGANIZATION_KEY GROUP BY ORGANIZATION_NAME
 SELECT ORGANIZATION_NAME, SUM(AREA) AS TOTAL_AREA FROM WAREUSER.FAC_ROOMS FR JOIN WAREUSER.FAC_ORGANIZATION FO ON FR.ORGANIZATION_KEY = FO.ORGANIZATION_KEY GROUP BY ORGANIZATION_NAME
An error occurred: ORA-00918: column ambiguously defined
An error occurred: ORA-00918: column ambiguously defined
[None, 'First error without replacing tables: ORA-00918: column ambiguously defined \n Second Error when replacing tables: ORA-00918: column ambiguously defined.', None, None, None]
[None]
SELECT WAREUSER.FAC_BUILDING.BUILDING_NUMBER, COUNT(FAC_ROOMS.ROOM), SUM(FAC_ROOMS.AREA) FROM WAREUSER.FAC_BUILDING JOIN FAC_ROOMS ON WAREUSER.FAC_BUILDING.BUILDING_KEY = FAC_ROOMS.BUILDING_KEY WHERE FAC_ROOMS.DEPT_CODE = 'department_code' GROUP BY WAREUSER.FAC_BUILDING.BUILDING_NUMBER
SELECT WAREUSER.FAC_BUILDING.BUILDING_NUMBER, COUNT(FAC_ROOMS.ROOM), SUM(FAC_ROOMS.AREA) FROM WAREUSER.FAC_BUILDING JOIN WAREUSER.FAC_ROOMS ON WAREUSER.FAC_BUILDING.BUILDING_KEY = WAREUSER.FAC_ROOMS.BUILDING_KEY WHERE WAREUSER.FAC_ROOMS.DEPT_CODE = 'department_code' GROUP BY WAREUSER.FAC_BUILDING.BUILDING_NUMBER
An error occurred: ORA-00904: "FAC_BUILDING"."BUILDING_KEY": invalid identifier
An error occurred: ORA-00904: "WAREUSER"."FAC_BUILDING"."BUILDING_KEY": invalid identifier
['First error without replacing tables: ORA-00904: "FAC_BUILDING"."BUILDING_KEY": invalid identifier \n Second Error when replacing tables: ORA-00904: "WAREUSER"."FAC_BUILDING"."BUILDING_KEY": invalid identifier.']
[None]
[None]
SELECT BUILDING_NAME, DATE_BUILT, (YEAR(CURRENT_DATE) - YEAR(DATE_BUILT)) AS BUILDING_AGE FROM WAREUSER.FAC_BUILDING
An error occurred: ORA-00904: "YEAR": invalid identifier
An error occurred: ORA-00904: "YEAR": invalid identifier
['First error without replacing tables: ORA-00904: "YEAR": invalid identifier \n Second Error when replacing tables: ORA-00904: "YEAR": invalid identifier.']
SELECT SUM(SQFT) FROM WAREUSER.SPACE_SUPERVISOR_USAGE
[None]
[None]

Not supported query type: You can ask a variety of questions related to the data stored in the MIT Data Warehouse. Here are some examples:

1. How many courses are offered in the fall term?
2. What is the total number of rooms in a specific building?
3. Who are the instructors for a specific course?
4. What is the total area of a specific building?
5. How many students are enrolled in a specific course?
6. What are the prerequisites for a specific course?
7. What is the contact information for a specific employee?
8. What is the description of a specific course?
9. What is the total number of employees in a specific department?
10. What are the courses offered by a specific department?
11. What is the office location of a specific employee?
12. What are the courses offered in a specific academic term?
13. What is the total number of courses offered in the current academic year?
14. What is the total number of students enrolled in a specific term?
15. What is the total number of courses offered online?
16. What is the total number of courses that require a specific prerequisite?
17. What is the total number of courses offered by a specific instructor?
18. What is the total number of courses offered in a specific global region?
19. What is the total number of courses that meet with other subjects?
20. What is the total number of courses that are equivalent to other subjects?

SELECT (COUNT(DISTINCT TIP_SUBJECT_OFFERED.SUBJECT_ID) / (SELECT COUNT(DISTINCT WAREUSER.CIS_COURSE_CATALOG.SUBJECT_ID) FROM WAREUSER.CIS_COURSE_CATALOG WHERE WAREUSER.CIS_COURSE_CATALOG.EFFECTIVE_TERM_CODE = 'given_term_code')) * 100 AS PERCENTAGE FROM TIP_SUBJECT_OFFERED WHERE TIP_SUBJECT_OFFERED.TERM_CODE = 'given_term_code'
SELECT (COUNT(DISTINCT WAREUSER.TIP_SUBJECT_OFFERED.SUBJECT_ID) / (SELECT COUNT(DISTINCT WAREUSER.CIS_COURSE_CATALOG.SUBJECT_ID) FROM WAREUSER.CIS_COURSE_CATALOG WHERE WAREUSER.CIS_COURSE_CATALOG.EFFECTIVE_TERM_CODE = 'given_term_code')) * 100 AS PERCENTAGE FROM WAREUSER.TIP_SUBJECT_OFFERED WHERE WAREUSER.TIP_SUBJECT_OFFERED.TERM_CODE = 'given_term_code'
An error occurred: ORA-00937: not a single-group group function
An error occurred: ORA-00937: not a single-group group function
['First error without replacing tables: ORA-00937: not a single-group group function \n Second Error when replacing tables: ORA-00937: not a single-group group function.']
['Not supported query type!']

In [15]:
df_q['responses_gpt_global_schema'] = gold_answers
df_q['failures_gpt_global_schema'] = failures

## Continue with the answers from gpt with schema information and query logs

In [ ]:
gold_answers = []
failures = []
for qs in df_q['gpt_sql_global_schema_and_logs']:
    gold_answer = []
    failure = []
    for q in qs:
        try:
            gold_answer.append(execute_query(q))
            failure.append(None)
        except Excpetion as e:
            gold_answer.append(None)
            failure.append(str(e))
    gold_answers.append(gold_answer)
    failures.append(failure)

In [ ]:
df_q['responses_gpt_global_schema_and_logs'] = gold_answers
df_q['failures_gpt_global_schema_and_logs'] = failures

# Calculate Accuracy, Precision, Recall and F1-Score

Accuracy: $\frac{\text{Number of correct predictions}}{\text{Total number of predictions}}$

Precision: $\frac{\text{True Positives}}{\text{True Positives} + \text{False Positives}}$

Recall: $\frac{\text{True Positives}}{\text{True Positives} + \text{False Negatives}}$

F1-Score: $2 \times \frac{\text{Precision} \times \text{Recall}}{\text{Precision} + \text{Recall}}$

In [23]:
def metric_(gold_set, prediction_set, recall=None):
  if gold_set is None or prediction_set is None:
    return np.array([0, 0, 0])
  if len(gold_set) == len(prediction_set) == 0:
    return np.array([1, 1, 1])

  true_positives = len(gold_set.intersection(prediction_set))
  false_positives = len(prediction_set - gold_set)
  false_negatives = len(gold_set - prediction_set)

  assert true_positives + false_positives == len(prediction_set)
  assert true_positives + false_negatives == len(gold_set)

  precision = true_positives / (true_positives + false_positives) if (true_positives + false_positives) != 0 else 1

  if recall is None:
    recall = true_positives / (true_positives + false_negatives) if (true_positives + false_negatives) != 0 else 0
  f1 = 2 * (precision * recall) / (precision + recall) if (precision + recall) != 0 else 0
  return np.array([precision, recall, f1])

In [29]:
def calculate_metrics_for(gpt_format:str):
    accuracies = []
    precisions = []
    recalls = []
    f1_scores = []
    if 'expected_responses' in df_q.keys():
        for i in range(len(df_q)):
            accuracy = []
            precision = []
            recall = []
            f1_score = []
            for j in range(len(df_q[gpt_format][i])):
                accuracy_ = []
                precision_ = []
                recall_ = []
                f1_score_ = []
                for h in range(len(df_q['sql'][i])):
                    if df_q['expected_responses'][i][h] is None or df_q[gpt_format][i][j] is None:
                        accuracy_val, precision_val, recall_val, f1_val =  0,0,0,0
                    else:
                        gold = set(df_q['expected_responses'][i][h])
                        prediction = set(df_q[gpt_format][i][j])
                        accuracy_val = int(gold == prediction)
                        precision_val, recall_val, f1_val = metric_(gold, prediction)
                    accuracy_.append(accuracy_val)
                    precision_.append(precision_val)
                    recall_.append(recall_val)
                    f1_score_.append(f1_val)
                    if accuracy_val == 1:
                        break
                if accuracy_val == 1:
                    accuracy.append(accuracy_val)
                    precision.append(precision_val)
                    recall.append(recall_val)
                    f1_score.append(f1_val)
                else:
                    accuracy.append(max(accuracy_))
                    precision.append(max(precision_))
                    recall.append(max(recall_))
                    f1_score.append(max(f1_score_))
            accuracies.append(accuracy)
            precisions.append(precision)
            recalls.append(recall)
            f1_scores.append(f1_score)
    return [accuracies, precisions, recalls, f1_scores]

In [30]:
accuracies_nocontext, precisions_nocontext, recalls_nocontext, f1_scores_nocontext = [], [], [], []
accuracies_nocontext, precisions_nocontext, recalls_nocontext, f1_scores_nocontext = calculate_metrics_for('responses_gpt_nocontent')
df_q['accuracies_nocontext'] = accuracies_nocontext
df_q['precisions_nocontext'] = precisions_nocontext
df_q['recalls_nocontext'] = recalls_nocontext
df_q['f1_scores_nocontext'] = f1_scores_nocontext

In [31]:
accuracies_global_schema, precisions_global_schema, recalls_global_schema, f1_scores_global_schema = calculate_metrics_for('responses_gpt_global_schema')
df_q['accuracies_global_schema'] = accuracies_global_schema
df_q['precisions_global_schema'] = precisions_global_schema
df_q['recalls_global_schema'] = recalls_global_schema
df_q['f1_scores_global_schema'] = f1_scores_global_schema

## old accuracies

In [225]:
arrray_of_metrics = ['accuracies', 'precisions', 'recalls', 'f1_scores']
for metric in arrray_of_metrics:
    print(metric + ' for nocontext: ' + str(sum([sum(a) for a in df_q[metric + '_nocontext']])/(len(df_q))))

accuracies for nocontect: 0.0
precisions for nocontect: 0.0
recalls for nocontect: 0.0
f1_scores for nocontect: 0.0

In [227]:
for metric in arrray_of_metrics:
    print(metric + ' for global schema: ' + str(sum([sum(a) for a in df_q[metric + '_global_schema']])/(len(df_q))))

accuracies for global schema: 0.26
precisions for global schema: 0.5003921568627451
recalls for global schema: 0.29496752758956857
f1_scores for global schema: 0.3009328845686428

In [27]:
arrray_of_metrics = ['accuracies', 'precisions', 'recalls', 'f1_scores']
for metric in arrray_of_metrics:
    print(metric + ' for nocontext: ' + str(sum([sum(a) for a in df_q[metric + '_nocontext']])/(len(df_q))))

accuracies for nocontext: 0.0
precisions for nocontext: 0.0
recalls for nocontext: 0.0
f1_scores for nocontext: 0.0

In [28]:
for metric in arrray_of_metrics:
    print(metric + ' for global schema: ' + str(sum([sum(a) for a in df_q[metric + '_global_schema']])/(len(df_q))))

accuracies for global schema: 0.0
precisions for global schema: 0.16666666666666666
recalls for global schema: 0.0
f1_scores for global schema: 0.0

# Save Dataframe with generated answers

In [ ]:
df_q.to_csv(str(prefix) + '/data/gpt_eval_Brandin_v0.1.csv', index=False)

## Save information in file

In [2]:
def save_accuracies(variant:str):
    current_datetime = datetime.datetime.now()
    file_content = '-->' + variant + '-' + str(current_datetime)+ ':'
    arrray_of_metrics = ['accuracies', 'precisions', 'recalls', 'f1_scores']
    for metric in arrray_of_metrics:
        file_content += metric + ' for nocontext: ' + str(sum([sum(a) for a in df_q[metric + '_nocontext']])/(len(df_q))) + '\n'
    for metric in arrray_of_metrics:
        file_content += metric + ' for global schema: ' + str(sum([sum(a) for a in df_q[metric + '_global_schema']])/(len(df_q)))+ '\n'
    with open(str(prefix) + '/data/evaluation.txt', "a") as file:
        file.write(file_content)

'2024-04-26 17:05:15.566718'

In [ ]:
sav_accuracies()